{
  "meta": {
    "exported_on": 1680398289,
    "version": "5.39.0"
  },
  "data": {
    "posts": [
            
      {
        "id": "0",
        "title": "Gating My Content",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='gating-content-in-jamstack-sites'>Gating Content in JAMstack Sites</h1><p>This section’s title was borrowed from a <a href='https://www.stackbit.com/'>Stackbit</a> article with the same title, <a href='https://www.stackbit.com/blog/gating-content-jamstack'>Gating Content in JAMstack Sites</a>.  Working through that article to password protect some of the content at <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a> is my tech pursit today.</p><h1 id='nope-not-on-netlify'>Nope, Not on Netlify</h1><p>😦Last evening I took a shot at implementing the <em>Netlify Identity</em> tricks from the aforementioned article, but could not easily get it to work.  The problem, I think, is that the <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a> on <em>Netlify</em> already uses <em>Netlify Identity</em> for authentication of my <em>Netlify CMS</em> forms, and adding a second, separate instance of that service isn’t trivial and perhaps isn’t even feasible.  I also tried implementing some quick <a href='https://www.npmjs.com/package/staticrypt'>Staticrypt</a> CLI protection but that also failed.  <em>Netlify</em> does provide a really quick and painless solution, but it costs $20/month, at a minimum, to enable it.</p><h1 id='new-staticrypt-strategy'>New Staticrypt Strategy?</h1><p>So, my next shot at this will involve creating a new <a href='https://www.11ty.dev/'>Eleventy</a> site just for the Wieting’s protected content.  Wish me luck and follow along here if you like.</p><h1 id='trying-azure-devops'>Trying Azure DevOps</h1><p>I recently created a personal Azure account, registered to <em>summitt.dweller@gmail.com</em>, and last evening (January 31, 2023) I took a dive into <a href='index.html'>Azure DevOps</a> under that account.  The “welcome” email that I received says I now have an “organization” URL at <a href='https://dev.azure.com/summittdweller'>https://dev.azure.com/summittdweller</a>.</p><p>I jumped into Azure DevOps because it looks like within that environment I can establish a Content Management System (CMS) not unlike the <em>NetlifyCMS</em> (or perhaps it IS NCMS) that I run for the Wieting Theatre, hosted with Netlify.com.  I really like <em>NetlifyCMS</em>, but thus far I’ve had limited success with it, and ONLY at Netlify.com where the user authentication process is nicely streamlined.  I hope that Azure DevOps has user authentication that’s just as easy to manage, and at less cost.</p><p>So, I guess the strategy now is to see what Azure DevOps has to offer, rather than venturing further with <a href='https://www.npmjs.com/package/staticrypt'>Staticrypt</a>.</p><hr/><p>That’s a TEMPORAY wrap, this post isn’t finished just yet.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1675036800
      }

,
      
      {
        "id": "1",
        "title": "Thanksgiving 2020",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Sorry, I’ve posted and experienced too much sadness in the last two weeks, and more. Two members of our immediate family, Sully and Stitch, passed away on November 14th and 20th, respectively. Sully was our male kitty, only about 6 years old and his passing was a real shock.  He was an ornery, sometimes grumpy cat, but very loveable at times. We miss him very much. Stitch was the matriarch of our cat family, about 18 years old and a gorgeous long-haired kitty. Stitch was in poor health the last year or so and not very playful so her passing was not such a shock, but it’s still hard to take. Fortunately, she passed comfortably in her sleep, nestled up on the couch between Mackenzie and Christine. We miss her too.</p><p>Sully and Stitch were buried on the McCune farm just a few days apart, not immediately next to one another, but not too far apart.  They sometimes played together when Stitch would tolerate Sully, but most of the time they were a short distance apart, just as they are now.</p><p>Enough of that, since today is Thanksgiving I’ll post no more sad news.  Instead, I want to share what I’m most thankful for… family.  And our family has two new fur babies too, Georgie and Jo.  Both are named after characters from Stephen King novels… perhaps a new trend?  Let me explain…</p><p>Georgie is the best-tempered cat I have ever known. 😸 She’s a little over a year old now so she still loves to play, and she’s made a habit of insisting that I hold her at least a couple of times each day, and give her kitty treats in exchange for snuggles. We captured Georgie in December 2019, she was the last of 3 kittens and 5 adult cats (Uno, Deuce, Tres, Veer and Go) that we caught as part of a TNR (Trap, Neuter and Release) effort that we started as the weather started to turn colder.  Georgie’s siblings found homes at the Tama Co. Humane Shelter (and later with a family in Belle Plaine) and with Morgan, who adpoted “Lint”, a long-haired solid gray kitten that was an odd part of the short-haired tuxedo cats living next door.</p><p><figure><img alt='Georgie - Approx. Age 13 Months' src='https://images.summittdweller.com/Kitty-Photos/Georgie/IMG_0051.png'/><figcaption>Georgie - Approx. Age 13 Months</figcaption></figure><figure><img alt='Georgie - Play with Me!' src='https://images.summittdweller.com/Kitty-Photos/Georgie/IMG_0057.png'/><figcaption>Georgie - Play with Me!</figcaption></figure></p><p>Georgie was the last of the 8 cats that we caught and she managed to avoid the traps quite well. Since we were concerned for her wellbeing, as she was all alone, we decided to try and catch her without a trap, and managed to do so after she elluded us for an hour or so.  She managed to get away by ducking into a storm sewer opening down the street, that’s why we named her Georgie, after the poor little boy featured in the opening of King’s story, “It”. Like “It”, she’s also a “collector”, always picking things up and carrying them away to who-knows-where.  😄</p><p>Jo, or JoJo, or Joey, or Cujo, is the new addition to the family. 🐱  Even before Stitch passed we put the word out that we might be looking for another kitty, somebody to keep Georgie company when no humans are home.  Well, we received word of a farm kitten looking for a home and paid it a visit one week ago on Thursday night, November 19. Stitch passed the next evening and on Sunday, November 22nd, the kitten came to live with us.  She saw the vet on Monday for an initial checkup and she’s sequestered in a spare bedroom for about 2 weeks to give her eyes and nose a chance to clear up… that process has started but she’s still got some eye goop as you can see.</p><p><figure><img alt='Jo - Approx. Age 2 Months' src='https://images.summittdweller.com/Kitty-Photos/Jo/IMG_0038.png'/><figcaption>Jo - Approx. Age 2 Months</figcaption></figure><figure><img alt='Jo - In a Rare, Calm Moment' src='https://images.summittdweller.com/Kitty-Photos/Jo/IMG_0034.png'/><figcaption>Jo - In a Rare, Calm Moment</figcaption></figure><figure><img alt='Jo - The Wee Beastie Sleeps After Turkey Dinner' src='https://images.summittdweller.com/Kitty-Photos/Jo/theWeeBeastieSleeps.jpg'/><figcaption>The Wee Beastie Sleeps after Turkey Dinner</figcaption></figure></p><p>Mackenzie suggested we name her “Cujo” since the farmer’s dog got hold of her in the farmyard. Also, Stephen King. 😄 The farmer was going to keep her as an indoor kitty due to the dog incident, but was overruled by her spouse. Their loss, our gain. We decided that the name could also stand for “Cute Jo”, and that stuck, along with all the other forms of the name. Jo is all kitten, but not afraid of anyone. She’s quick to snuggle up, but also loves to claw and bite when she’s in a mood to play.  We are trying to teach her that toys=play while toes=snuggles, and the same for other body parts. I think she’ll come around just fine.  Just wish she didn’t have to quarantine for another 10 days. 😦  But of course, it’s #2020.</p><p>That’s a wrap. Until next time… but only after I play with Georgie and give Jo another snuggle.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1606348800
      }

,
      
      {
        "id": "2",
        "title": "Finale Workflow Documentation",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Mackenzie, my daughter, and I created this post documenting my wife’s <a href='https://www.finalemusic.com/'>Finale</a> workflow for scanning and editing music on her Mac.  We did this for my wife to <strike>celebrate her birthday</strike> preserve her sanity.  Well, it was worth a shot.  The birthday idea seemed more romantic, but mental health comes first.</p><p>The document was created using a process we recently built and documented in <a href='https://static.grinnell.edu/dlad-blog/posts/138-creating-better-documentation/'>Creating Better Documentation</a>.  In this instance of the process we tried to annotate in yellow screen capture elements that need attention, and used red annotation to indicate things that require input or action of some kind.  In some of the later images we failed and things that should be red were left highlighted in yellow.  Sorry.</p><h1 id='begin-by-scanning'>Begin by Scanning</h1><p>The first step involved launching the <em>Canon MF Scan Utility</em> as you see below.  This is the software she uses to scan music pages on the multi-function scanner attached to her Mac.</p><p><figure><img alt='Launch the Canon MF Scan Utility' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0010.png'/><figcaption>Launch the Canon MF Scan Utility</figcaption></figure></p><p>We verified that the correct scanner is selected, loaded the score into the scanner*, and clicked <code>Custom</code> to begin the scan.  Then, wait for the scanner to warm up, if necessary.</p><p>*Note that the sheet music can be placed on the scanner glass one-sheet-at-a-time, or if the pages are 8.5x11, one-sided, and in good condition, they may be loaded in the document feeder to scan continuously.  In this particular case we were able to use the document feeder.</p><p><figure><img alt='Select Custom scanning' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0015.png'/><figcaption>Select Custom scanning</figcaption></figure></p><p><figure><img alt='Waiting for the scanner to warm up' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0020.png'/><figcaption>Waiting for the scanner to warm up</figcaption></figure></p><p>Once the scanner is ready the mechanical process of scanning should begin.  When scanning one-page-at-a-time some user intervention will be required.</p><p><figure><img alt='Scanning in progress' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0028.png'/><figcaption>Scanning in progress</figcaption></figure></p><p>When the scan is complete a <code>Save Settings</code> window should pop-up.  We reviewed the information and made appropriate selections where noted below, then clicked <code>OK</code> to continue.  <strong>Be sure to set and take note of the <code>File Name:</code> and <code>Save in:</code> fields!  Also, it’s probably wise to ensure that the <code>Data Format:</code> is “TIFF” and the <code>Save to a subfolder with current date</code> control is checked.</strong></p><p><figure><img alt='Save scan settings' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0046.png'/><figcaption>Save scan settings</figcaption></figure></p><h1 id='smartscore-64-pro'>SmartScore 64 Pro</h1><p>A <em>SmartScore 64 Pro</em> window will automatically open, <strong>but don’t be confused, we don’t want to run this application yet!  Click the <code>Cancel</code> button to close <em>SmartScore 64 Pro</em></strong>.</p><p><figure><img alt='SmartScore Pro launches automatically' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0064.png'/><figcaption>SmartScore Pro launches automatically but needs to be closed</figcaption></figure></p><p>Once <em>SmartScore 64 Pro</em> is closed, we need to open it properly by clicking its icon in the dock.  😦</p><p><figure><img alt='Properly launching SmartScore' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0078.png'/><figcaption>Properly launching SmartScore</figcaption></figure></p><p>Now <em>SmartScore</em> is open to the <code>Task Window</code> where we selected <code>Recognition</code> to convert the scanned images to music XML.</p><p><figure><img alt='Starting the SmartScore recognition process' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0089.png'/><figcaption>Starting the SmartScore recognition process</figcaption></figure></p><p>Next, we add the files of our scanned pages to the recognition processing list.</p><p><figure><img alt='Add scans to SmartScore recognition' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0094.png'/><figcaption>Add scans to SmartScore recognition</figcaption></figure></p><p>In the file dialog we navigate to the scanned page TIFFs and select them all.  The order of files in the selection is NOT critical.  With all files selected click <code>Open</code>.</p><p><figure><img alt='Navigate to the scan files and select them' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0105.png'/><figcaption>Navigate to the scan files and select them</figcaption></figure></p><p>The next <code>Begin Recognition</code> screen offers controls to change the file order if necessary.  Once the files are in the proper order click <code>Begin Recognition</code> button to proceed.</p><p><figure><img alt='Order the TIFFs and begin recognition' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0134.png'/><figcaption>Order the TIFFs and begin recognition</figcaption></figure></p><p>Be patient, the recognition process may take a few minutes.</p><p><figure><img alt='Recognition in progress' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0151.png'/><figcaption>Recognition in progress</figcaption></figure></p><p>When the recognition is complete a <code>System Report</code> appeared prompting us to <code>Open SmartScore file</code>.  We did.</p><p><figure><img alt='SmartScore system report' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0155.png'/><figcaption>SmartScore system report</figcaption></figure></p><p>Next, the <code>Unify Score</code> window popped up and we verified the default selections shown below before clicking <code>OK</code>.</p><p><figure><img alt='Unify score pop-up' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0157.png'/><figcaption>Unify score pop-up</figcaption></figure></p><p>When prompted to save the score be sure to select <code>Music XML (*.xml)</code> and take note of where the file will be saved.</p><p><figure><img alt='Saving as XML' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0168.png'/><figcaption>Saving as XML</figcaption></figure></p><p>You may be prompted to save each scan/file individually.  Once the file save is confirmed you can close <em>SmartScore 64 Pro</em>.</p><p><figure><img alt='Confirm save and close SmartScore' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0189.png'/><figcaption>Confirm save and close SmartScore</figcaption></figure></p><h1 id='finale'>Finale</h1><p>Next, open <em>Finale</em> from the dock as shown below.</p><p><figure><img alt='Open Finale' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0199.png'/><figcaption>Open Finale</figcaption></figure></p><p>After a minute or more the <em>Finale</em> <code>Launch Window</code> should appear, and we selected <code>IMPORT MUSICXML</code> as shown below.</p><p><figure><img alt='Selecting IMPORT MUSICXML' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0209.png'/><figcaption>Selecting IMPORT MUSICXML</figcaption></figure></p><p>We navigated to the XML file that was saved in <em>SmartScore</em> and clicked <code>Open</code> to load it in <em>Finale</em>.</p><p><figure><img alt='Opening the saved MusicXML file' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0224.png'/><figcaption>Opening the saved MusicXML file</figcaption></figure></p><p>That’s it, the scanned score is now loaded in <em>Finale</em> where it is ready to be edited!  It’s a good idea to click <code>Save As...</code> routinely to save your changes as you proceed.</p><p><figure><img alt='Save your Finale work' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0237.png'/><figcaption>Save your Finale work</figcaption></figure></p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1675814400
      }

,
      
      {
        "id": "3",
        "title": "Moving to Netlify CMS",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>In my last post, <a href='http://localhost:1313/posts/2021/04/moving-to-netlify-cms/posts/2021/03/adding-netlify-to-this-blog/'>Adding <em>Netlify CMS</em> for Editing This Blog</a>, I was able to successfully engage the <a href='https://www.netlifycms.org/'><em>Netlify CMS</em></a> with a “local” copy of this blog.  But I never got the CMS to work in production with this blog’s App on <a href='https://www.digitalocean.com/'><em>DigitalOcean</em></a> (<em>DO</em>). I should note that <em>DO</em>’s support folks were very helpful, but in the end I think all of the client-side stuff that <em>Netlify CMS</em> is doing was more than they were willing (capable?) of helping me overcome. That’s probably my fault more than their’s; client-side isn’t my strong suit.</p><p>In the week since then I have, however, been able to stand up a new working copy of the <a href='https://wieting.Tama-Toledo.com'><em>Wieting Theatre</em> website</a> on <a href='https://www.netlify.com/'><em>Netlify.com</em></a>, where it enjoys the same kind of automated builds and automatic deployment that I previously found at <em>DO</em>.  The big difference, at Netlify.com my <em>Netlify CMS</em> depoloyment works locally AND in production, giving me the ability to allow content editors, even those who don’t have a <em>Netlify.com</em> or <em>GitHub</em> account, to do what they do best, edit their content.</p><h2 id='the-_wieting-theatre_s-new-site-and-the-_crb_'>The <em>Wieting Theatre</em>’s New Site, and the <em>CRB</em></h2><p>So this post started as a brain dump, chronicling how I got <a href='https://Wieting.Tama-Toledo.com'>https://Wieting.Tama-Toledo.com</a> to work.  But, instead of hashing out how I “did” it, I’m going to show you how I’m doing something similar, for a site that features the <em>Compass Rose Band</em>, or <em>CRB</em>, my brother-in-law’s band out of Cedar Rapids, Iowa.</p><h2 id='netlify-identity'>Netlify Identity</h2><p>I think the real key to all of this is a <em>Netlify.com</em> agent called <a href='https://docs.netlify.com/visitor-access/identity/'><em>Netlify Identity</em></a>. From the <em>Netlify.com</em> site and documentation…</p><div class='original'><p><em>Netlify Identity</em> service brings a full suite of authentication functionality, backed by the <em>GoTrue</em> API. This allows you to manage and authenticate users on your site or app, without requiring them to be users of <em>Netlify</em> or any other service. You can use this for gated content, site administration, and more.</p></div><p>In theory, <em>Netlify Identity</em> can be deployed anywhere, but in practice, setting it up can be quite tricky (at least it was for me).  That’s where <em>Netlify.com</em> shines, and that’s understandable since they created both <em>Netlify CMS</em> and <em>Netlify Identity</em>. The two creations play well together, and make life easier for a devops like me. Well played indeed.</p><p>If you read my previous post you know that in a <a href='https://gohugo.io'><em>Hugo</em></a> site, like this one, the <code>./static/admin/config.yml</code> file holds all of your CMS info.  If you host content on <em>Netlify.com</em> with <em>Netlify CMS</em> and <em>Netlify Identity</em> engaged, all you really need in that config file is something like this:</p><pre tabindex='0'><code>backend:  name: git-gateway  branch: main...</code></pre><p>The rest of the CMS “magic” takes place in a server-side access manager that you can find at your <em>Netlify.com</em> site folder at <code>https://app.netlify.com/sites/[site-name]/identity</code>.  The client-side of the access/identity equation can be handled with an app template, and you can choose from many starter templates found at <a href='https://www.netlifycms.org/docs/start-with-a-template'>Start with a Template</a>.</p><h3 id='external-oauth-without-_netlifycom_'>External OAuth without <em>Netlify.com</em></h3><p>If you wish to proceed without using <em>Netlify.com</em> as your host, you’ll find a number of options at <a href='https://www.netlifycms.org/docs/external-oauth-clients/'>External OAuth Client</a>. Beware, this option isn’t for a server-side guy like me, and the <em>Netlify.com</em> option is quick, easy, and cheap… at least I think so.</p><h2 id='building-a-new-_compass-rose-band_-site-on-_netlifycom_'>Building a New <em>Compass Rose Band</em> Site on <em>Netlify.com</em></h2><p>Rather than rehashing the story of my <em>Wieting Theatre</em> migration to <em>Netlify.com</em>, I’m going to repeat that process and capture the journey while migrating our existing <em>Compass Rose Band</em> site from <em>DO</em>.</p><h3 id='using-_netlifycom_-and-one-click-hugo-cms'>Using <em>Netlify.com</em> and <code>one-click-hugo-cms</code></h3><p>From the <a href='https://www.netlifycms.org/docs/start-with-a-template'>Start with a Template</a> I clicked the <code>Deploy to Netlify</code> button under the ‘Hugo Site Starter’ option. This was super easy since <em>Netlify.com</em> already knows me… because I created a free account about a week ago. That selection took me to a screen where I was asked to identify a new <em>Github</em> repostory. Again, super easy because I had already logged in to <em>Github</em> earlier.</p><p>The default name for this new repository is <code>one-click-hugo-cms</code>, same as the template repository it will be built from. I choose to name my new repo <code>compass-rose-band-one-click</code>, for obvious reasons. That repository can be found at <a href='https://github.com/SummittDweller/compass-rose-band-one-click'>https://github.com/SummittDweller/compass-rose-band-one-click</a> where the <code>README.md</code> file is titled “Hugo template for Netlify CMS with Netlify Identity”. The initial repository contents looked like this:</p><p><figure><img alt='one-click-hugo-cms' src='http://localhost:1313/img/one-click-hugo-cms.png'/><figcaption></figcaption></figure></p><h3 id='replacing-the-site'>Replacing the <code>/site</code></h3><p>A default <em>Hugo</em> site is automatically built and deployed for you as part of the one-click process, and <em>Netlify.com</em> will supply an address so you can see your creation. But that’s not the <em>Compass Rose Band</em>! No problem, I found it quick and easy to replace the default template site by first cloning my new repo to my workstation, and replacing the <code>/site</code> directory with my own contents.  It went like this…</p><ul><li><code>cd ~/GitHub</code>  ⬅ This is where I keep local copies of all my GitHub projects.</li><li><code>git clone https://github.com/SummittDweller/compass-rose-band-one-click</code></li><li><code>cd compass-rose-band-one-click</code></li><li><code>git branch -m master main</code>  ⬅ Optional step, changes my local branch name to ‘main’.</li><li><code>rm -fr site/*</code>  ⬅ Remove the template site, the contents of <code>/site</code>.</li><li><code>cp -fr ~/GitHub/compass-rose-band/* site/.</code>  ⬅ Copy my local CRB site<sup>*</sup> to <code>/site</code>.</li></ul><p><sup>*</sup>Note that copying in the manner excludes all . files and directories, so the <code>.git</code> folder is NOT copied. This is IMPORTANT!</p><p>At this point, your old site has a new home in <code>./site</code> so if you navigate there and do <code>hugo server</code> you should see a local instance of the site.  Like so…</p><ul><li><code>cd site</code></li><li><code>hugo server</code></li><li>Visit <code>localhost:1313</code>, or whatever localhost site is indicated, to see your site.</li></ul><h3 id='pushing-the-site-to-_github_'>Pushing the Site to <em>Github</em></h3><p>So, now your <em>Netlify.com</em> project lives in a directory like my <code>~/GitHub/compass-rose-band-one-click</code>, and the corresponding <em>Hugo</em> site contents are in the <code>./site</code> folder there. To deploy this new copy of your site to <em>Netlify.com</em> simply do like this…</p><ul><li><code>cd ~/GitHub/compass-rose-band-one-click</code></li><li><code>git add .</code></li><li><code>git commit -m 'Now with CRB site contents in ./site'</code></li><li><code>git push -u origin main</code></li></ul><h3 id='deploying-the-site-on-_netlifycom_'>Deploying the Site on <em>Netlify.com</em></h3><p>By default, pushing your changes to <em>Github</em> will automatically deploy them to your <em>Netlify.com</em> site, but you pushed to <code>main</code>, not <code>master</code>, so no synchornization is likely. But that’s easy to fix.</p><p>Navigate your browser to your <em>Netlify.com</em> “team” page, find your new project there, and click on <code>Site Settings</code>. Next you’ll see options for things like changing the name of your project and site.  I changed mine to <code>compass-rose-band-one-click</code> to match my <em>Github</em> repo name.</p><p>Visit the <code>Build &amp; Deploy</code> link in the menu on the left side of the page, find the <code>Deploy contexts</code> info and click <code>Edit settings</code> there so you can change the production branch setting from <code>master</code> to <code>main</code>.  Leave the default setting of “Any pull request against your production branch / branch deploy branches” selected.</p><p>Next, visit the “Deploys” page in your <em>Netlify.com</em> project page at <code>https://app.netlify.com/sites/[project-name]/deploys</code>, mine is <a href='https://app.netlify.com/sites/compass-rose-band-one-click/deploys'>https://app.netlify.com/sites/compass-rose-band-one-click/deploys</a>, and click the <code>Trigger deploy</code> button there.  You should then see a log of the deployment as it runs, and this time it should target your new <code>main</code> branch with your updated <code>./site</code> contents.</p><p>If successful you should see a screen featuring a block like this one:</p><p><figure><img alt='Successfuly deployed on &lt;em&gt;Netlify.com&lt;/em&gt;' src='http://localhost:1313/img/netlify-preview-deploy.png'/><figcaption></figcaption></figure></p><p>Click on the <code>Preview deploy ⬈</code> link and voilà, your site!</p><h2 id='now_netlify-cms_'>Now…<em>Netlify CMS</em></h2><p>It’s getting late on this Sunday night so I’ll share the first few lines from the latest copy of my new project’s <code>./site/static/admin/config.yml</code> file for <em>Netlify CMS</em>.</p><pre tabindex='0'><code>backend:  name: git-gateway  branch: main## To make local_backend mode work you must run 'npx netlify-cms-proxy-server' in its own terminal window##   from the project root.  See https://www.netlifycms.org/docs/beta-features/ for details.local_backend: truemedia_folder: site/static/img    public_folder: /img...</code></pre><h3 id='whats-all-that'>What’s All That?</h3><p>I’m back, as promised, and you’re probably asking what all that stuff in the <code>config.yml</code> file is doing? Well, as mentioned earlier, the simple <code>backend:</code> section (first three lines) links the CMS to the <code>main</code> branch of our new <em>Github</em> project.  The rest isn’t required, unless you also want to use the CMS on a local clone of the project, like when making mass edits locally.</p><p>Let me try to explain.</p><h3 id='local_backend-a-_netlify-cms_-beta-feature'><code>local_backend:</code> A <em>Netlify CMS</em> Beta Feature</h3><p>If you visit the <em>Netlify CMS</em>’ <a href='https://www.netlifycms.org/docs/beta-features/'>Beta Features!</a> pages you’ll see <code>local_backend</code> mentioned near the very top. [<em>Note that as a beta feature this information is bound to move at some point.</em>] That feature enables configuration of an option to make the CMS avaialble when working locally on a cloned, presumably, copy of the <em>Github</em> repository.  The beta documentation mentions running <code>npx netlify-cms-proxy-server</code> as part of the process.</p><h3 id='a-local-problem-with-site--no-not-really'>A Local Problem with <code>./site</code>?  No, Not Really</h3><p>So, in the local clone of my new <em>Compass Rose Band</em> one-click <em>Hugo</em> website, the “one-click” <em>Netlify CMS</em> parts live in the project’s root directory, and the <em>Hugo</em> site lives just “below” it in <code>./site</code>.  Accordingly my <code>media_folder:</code> setting shown above includes the <code>site/</code> prefix, and the same is true of all the <code>config.yml</code> keys that end in <code>folder:</code>.  This is correct for production, and it also works with a local clone IF I launch things correctly!</p><p><em>Hugo</em> and the <code>hugo server</code> command that I need to preview local changes demands that I either <code>cd site</code> before I run it, or override the command’s path by specifying <code>hugo server -s site</code>.  Only this 2nd approach works!</p><p>So the process that’s needed for local development and testing, including <em>Netlify CMS</em> looks like this for me:</p><ul><li>If I don’t yet have the project locally I will begin with…<code>cd ~/GitHub; git clone --recursive https://github.com/SummittDweller/compass-rose-band-one-click; cd compass-rose-band-one-click</code></li><li>If I already have a local clone I’ll do this…<code>cd ~/GitHub/compass-rose-band-one-click; git pull</code></li></ul><p>From here on out there’s just one process, like so…</p><ul><li><code>npx netlify-cms-proxy-server</code>   ⬅ In a new terminal window. See next section of this post.</li><li><code>atom .</code>  ⬅ Launch <em>Atom</em> in the working directory.</li><li><code>hugo server -s site</code>  ⬅ <strong>Important:</strong> Don’t forget the <code>-s site</code> option!</li><li>Create and edit files as needed. Changes should be immediately visible in <code>http://localhost:1313</code>.</li><li>To edit or create content using <em>Netlify CMS</em>, just visit <code>http://localhost:1313/admin/</code>.</li><li>When all changes are complete…<ul><li><code>git add .</code></li><li><code>git commit -m 'a brief message here'</code></li><li><code>git push</code></li></ul></li></ul><h3 id='requires-_npx_-part-of-_nodejs_'>Requires <em>npx</em>, Part of <em>Node.js</em></h3><p>The <code>npx</code> command mentioned above requires that <em>npx</em> be installed, and it’s part of <em>Node.js</em>.  To make it run properly I followed guidance from <a href='https://treehouse.github.io/installation-guides/mac/node-mac.html'>https://treehouse.github.io/installation-guides/mac/node-mac.html</a> to ensure both were installed.  In at least one instance I also had to run <code>brew upgrade node</code> and <code>npm i -g npx</code> to ensure that <em>Node.js</em> was up-to-date, and that <em>npx</em> was available as needed.</p><p>The <code>npx netlify-cms-proxy-server</code>, loads and runs the <em>netlify-cms-proxy-server</em> script, and in doing so it will tie up your terminal window.  So, it’s best to <strong>do this in a separate terminal window!</strong>  Don’t put the command in the background (using a <code>&amp;</code> flag at the end) as this won’t allow you to see if the command is working properly. When you run this command you should see some feedback from the script indicating what it is doing. The script binds to your working directory then effectively routes all <em>Netlify CMS</em> actions, performed in this instance via <code>http://localhost:1313/admin/</code>, to the local <em>git</em> repo there.</p><h2 id='ok-now-we-need-a-proper-domain'>Ok, Now We Need a Proper Domain</h2><p>So, in its original form the <em>Compass Rose Band</em> site is aliased to three different domains:</p><ul><li><a href='https://compassroseband.net'>https://compassroseband.net</a>,</li><li><a href='https://thecompassroseband.com'>https://thecompassroseband.com</a>, and</li><li><a href='https://thecompassroseband.net'>https://thecompassroseband.net</a></li></ul><p>I choose to try migrating these domains to the new <em>Netlify.com</em> site one-at-a-time, starting with the least-used domain, <em>thecompassroseband.net</em>.</p><p>To do this I started by visiting my <em>Netlify.com</em> account/team and the <code>Domains</code> menu, then my project-specific domain settings at <a href='https://app.netlify.com/teams/summittdweller/dns/thecompassroseband.net'>https://app.netlify.com/teams/summittdweller/dns/thecompassroseband.net</a>.  In this page I’m given a list of 4 <em>Netlify.com</em> name servers that I can use for this particular project.  I made note of the four before moving on.</p><p>Next step was to visit my registrar, <em>enom.com</em>, where I have a control screen for editing DNS records and name servers.  I set the name server values for <em>thecompassroseband.net</em> there to the values that <em>Netlify.com</em> provided. And then, we wait… for the changes to propogate.</p><p>Fortunately, <em>Netlify.com</em> is on the ball… when I visit my new site’s domain controls page, <a href='https://app.netlify.com/sites/compass-rose-band-one-click/settings/domain'>https://app.netlify.com/sites/compass-rose-band-one-click/settings/domain</a>, I find a widget that looks like this:</p><p><figure><img alt='DNS Propogation' src='http://localhost:1313/img/netlify-dns-propogation.png'/><figcaption></figcaption></figure></p><p>The cog behind “Waiting on DNS propagation” is spinning while <em>Netlify.com</em> waits for the transfer to happen.  So, I’m going to go for a walk and see what that cog looks like in an hour or two.</p><hr/><p>Clear as mud?  Give it a try, and hopefully it will begin to make sense.  Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1617494400
      }

,
      
      {
        "id": "4",
        "title": "Paperless-ng on CentOS7",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Over the end-of-year holiday break in 2020 I managed to ressurect my old home-office CentOS 7 development server.  I had a mind salvage and update <a href='https://github.com/the-paperless-project/paperless'>Paperless</a> on that server, and I did manage to do that.  However, along the way I discovered the <em>Paperless-ng</em> branch of the project and I installed it, using <em>Docker</em> as suggested, by creating a new project and configuration I’ve saved as <a href='https://github.com/SummittDweller/paperless-ng-dockerfiles'>summittdweller/paperless-ng-dockerfiles</a>.</p><h2 id='mounting-my-readynas-share'>Mounting my ReadyNAS Share</h2><p>To successfully mount my <em>ReadyNAS/Paperless</em> SMB share I had to do the following on <em>centos7</em> as <em>root</em>:</p><pre tabindex='0'><code>mount -t cifs -o username=mark,vers=1.0 //192.168.1.48/Paperless /mnt/paperless</code></pre><p>Unfortunately, this did NOT work!  Everything appeeared to be working properly except that files copied into <em>//ReadyNAS/Paperless/consume</em> were NOT shared into the container as mapped, so no ingest was triggered.  I could only get the ingest to start if I used <em>docker cp…</em> to copy the files into the mapped <em>./consume</em> directory.</p><h2 id='mounting-homemarkpaperless-ng-to-support-ingest'>Mounting <em>/home/mark/paperless-ng</em> To Support Ingest</h2><p>So, I turned to <a href='https://devopspoints.com/centos-7-setting-up-samba-and-nfs-for-file-sharing.html'>https://devopspoints.com/centos-7-setting-up-samba-and-nfs-for-file-sharing.html</a> for setup of SAMBA on <em>CentOS7</em> at <em>192.168.1.22</em> with hopes that I could mount <em>/home/mark/paperless-ng/consume</em> and get Paperless auto-ingest working.</p><p>It works!  In fact, it works quite well.</p><p>Paperless-ng is configured to watch for changes in <em>/home/mark/paperless-ng/consume</em> and will ingest any unique .pdf files dropped there.  Note that <em>Paperless-ng</em> is smart enough to keep track of all the files it has ingested so it won’t knowingly ingest a duplicate.</p><p>It’s worth noting that there is also a <em>/home/mark/paperless-ng/exported</em> directory where regular exports of Paperless documents can be kept before back-up to <em>//ReadyNAS</em> storage.</p><h2 id='still-no-good'>Still NO Good</h2><p>So, the network configuration indicated above appears to work when copying files from a Mac into the target share, <em>/home/mark/paperless-ng/consume</em>.  Unfortunately I’ve had NO luck whatsoever getting my <em>Brother ADS-1500W</em> scanner to network with ANYTHING.  The setup seems just fine, but whatever I scan eventually gives me a “Send Failed” message with NO other explanation.</p><p>After spending many, many, many hours dealing with this I have officially given up!</p><h2 id='a-new-usb-workflow'>A New USB Workflow</h2><p>My <em>Brother ADS-1500W</em> scanner supports a number of transfer options including USB. There’s only one USB port on the back of the scanner so it’s relatively foolproof.</p><p>To engage this workflow I formatted a USB stick as <em>FAT32</em> and named it <em>PAPERLESS</em>.  When this stick is inserted into the scanner a <em>BROTHER</em> directory is created and scans named <em>mmddyynn.pdf</em> are generated there.</p><p>Once a set of documents has been scanned using the <em>to USB</em> profile, the USB stick can be removed from the scanner and plugged in to any <em>CentOS7</em> USB input port.  The <em>PAPERLESS</em> volume will automatically appear on the desktop and all that one must do is copy/paste (select and drag) each of the .pdf files from <em>/mnt/paperless/BROTHER</em> to the target <em>consume</em> diretory at <em>/home/mark/paperless-ng/consume</em>.</p><h2 id='modifying-inotify-in-centos-7'>Modifying <em>inotify</em> in CentOS 7</h2><p>The <em>~/Desktop/README.md</em> file on node <em>centos7</em> documents a necessary step that I discovered as the key to making <em>Paperless</em> consume/ingest process work.  The commands are:</p><pre tabindex='0'><code>cat /proc/sys/fs/inotify/max_user_watches          # default is 8192sudo sysctl fs.inotify.max_user_watdhes=1048576    # necessary increase</code></pre><h2 id='starting-and-stopping-paperless-ng'>Starting and Stopping <em>Paperless-ng</em></h2><h3 id='starting-paperless-ng'>Starting <em>Paperless-ng</em></h3><p>Simple, to start it on <em>CentOS7</em>:</p><pre tabindex='0'><code>cd /home/mark/GitHub/paperless-ng-dockerfilesdocker-compose up -d</code></pre><p>Or, simply reboot <em>CentOS7</em>.  See auto-start details in the section below.</p><h3 id='stopping-paperless-ng'>Stopping <em>Paperless-ng</em></h3><p>Also simple, on <em>CentOS7</em>:</p><pre tabindex='0'><code>cd /home/mark/GitHub/paperless-ng-dockerfilesdocker-compose down</code></pre><h2 id='auto-starting-paperless-ng'>Auto-Starting <em>Paperless-ng</em></h2><p>I found and followed <a href='https://www.thegeekdiary.com/centos-rhel-7-how-to-make-custom-script-to-run-automatically-during-boot/'>this resource</a> to create a boot-time auto-start script to configure and launch <em>Paperless-ng</em> whenever <em>CentOS7</em> is booted.  My script is <em>/var/tmp/startup_script.sh</em> and the process of running it echoes some output to <em>/var/tmp/script.out</em>.</p><p>I saved the script as a <a href='https://gist.github.com/SummittDweller/9e179f948faf0d30fe8069f684b7d762'>public gist</a> for safe-keeping.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1609977600
      }

,
      
      {
        "id": "5",
        "title": "Proper Python",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>What follows is the <code>README.md</code> file from my <em>GitHub</em> repo where <a href='https://blog.summittdweller.com'>https://blog.summittdweller.com</a> is built.  It outlines how to “properly” add Python to a project such that we can create an easily reproducible “virtual environment” without storing the necessary Python libraries in <em>GitHub</em>.</p><p>From the <code>README.md</code>…</p><div class='original'><h1 id='blogs-summittdweller'>blogs-SummittDweller</h1><p>The Python portions of this repo were gleaned from <a href='https://github.com/SummittDweller/hikes'>https://github.com/SummittDweller/hikes</a>.This is the repo for my <a href='https://blog.SummittDweller.com/'>https://blog.SummittDweller.com/</a> static website.</p><h2 id='latest-python-improvements'>Latest Python Improvements</h2><p>Using guidance at <a href='https://predictivehacks.com/how-to-work-with-vs-code-and-virtual-environments-in-python/'>https://predictivehacks.com/how-to-work-with-vs-code-and-virtual-environments-in-python/</a> I successfully created a new <code>.venv</code> virtual environment.  The commands I used to do this were…</p><pre tabindex='0'><code>╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*›╰─$ python3 -m venv .venv╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*›╰─$ source .venv/bin/activate(.venv) ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main› ╰─$ pip3 freeze &gt; python-requirements.txt(.venv) ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*›╰─$ pip3 install -r python-requirements.txt</code></pre><p>Then I used <code>COMMAND-SHIFT-P</code> to select and <code>Python: Select interpreter</code> to choose the new <code>.venv</code> Python.  After that…</p><pre tabindex='0'><code>(.venv) ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummitDweller ‹main*›╰─$ python3 consolidate.py --start 20220806 --end 20220825(.venv) ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummitDweller ‹main*›╰─$ hugo server</code></pre><h2 id='rebuilding-a-local-environment'>Rebuilding a Local Environment</h2><p>Based on guideance from <a href='https://stackoverflow.com/questions/6590688/is-it-bad-to-have-my-virtualenv-directory-inside-my-git-repository'>https://stackoverflow.com/questions/6590688/is-it-bad-to-have-my-virtualenv-directory-inside-my-git-repository</a> I’ve reconstructed this project such that Python artifacts do NOT propogate into Github.</p><p>The project should automatically “rebuild” as necessary when opened in VSCode, but if the Python virtual environment needs to be recreated use…</p><pre tabindex='0'><code>source .venv/bin/activate &amp;&amp; pip3 install -r python-requirements.txt</code></pre><h2 id='deployment-via-digitalocean'>Deployment via DigitalOcean</h2><p>In order to deploy this <code>starter</code> static app on <em>DigitalOcean</em> I had to PERMANENTLY move all of my Python components (<code>.py</code> scripts and <code>requirements.txt</code>) to a <code>.python</code> directory to hide it from view during app creation.  Before moving these elements <em>DigitalOcean</em> would consistently try to deploy my app as Python, and that’s not right.</p><p>See <em>DigitalOcean</em> ticket [#06849069] <code>Hugo static site with Python components builds fail</code> for details.</p><p>The response I received from <em>DigitalOcean</em>…</p><div class='original'><p>Hello,</p><p>Thanks for contacting DigitalOcean.</p><p>We appreciate you reaching out to us about your Hugo static site. From what you mentioned it does sound like your app is getting detected as a python webservice rather then a static site due to the requirements.txt file you had in the root of your repo.</p><p>Unfortunately this is currently what App platform uses to detect applications as python apps. Either having a requirements.txt file or a setup.py file will cause that detection. Our engineers are looking into options to specify the build pack used rather then relying upon the auto detection, which would address this issue in your case, but don’t have a timeline yet for implementing it.</p><p>In the mean time the work around that you have specified here should work fine for this. It should cause the app to be detected as a static site rather then python. Hopefully it isn’t impacting anything else in your app’s build process.</p><p>If you have any questions, please let us know.</p><p>Regards,NateSenior Cloud Support EngineerCheck out our community for great tutorials, articles and FAQs!digitalocean.com/community</p><p>ref:_00Df218t5m._5004P21l4JM:ref</p></div><h3 id='remedy'>Remedy</h3><p>Based on the response above I’m making final changes to eliminate the <code>.python</code> folder, renaming <code>.python/requirements.txt</code> as <code>python-requirements.txt</code>, and pulling all other contents of <code>.python</code> into the root of the project.</p></div></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1663977600
      }

,
      
      {
        "id": "6",
        "title": "→ Home Automation",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>During the <a href='https://en.wikipedia.org/wiki/COVID-19_pandemic'>COVID-19 pandemic</a> I decided, while working endlessly from my home office, to resurect the hanging bird feeder outside my office window.  I like having the birds visit, but I’ve noticed one problem… starlings! They are cranky, bully bastards and chase all the welcome visitors away, if I let them. Well, I don’t intend to let them anymore. 😁 I won’t go into details here but my remedy involves removing the screen from my office window, and occasionally opening the window itself.</p><p>There are two issues with the window… it’s a big, double casement window with a pair of crank mechanisms for opening, and the one that I need to open most often is situated behind my mini-fridge. It’s difficult to get to the opener crank, and even hard to open or close it “gently”. The other issue is that while the window is open my office door needs to be closed so that our house cats won’t wander in and decide to “escape” through the open window. 😾 I suppose the cats could provide some extra starling deternt, but they are not as selective as I am. If it moves, they want to catch it. 🐈</p><p>The solution, I hope, is to build and install an automated window opener, one that I can control without getting out of my seat. It would also be nice if I had the same option to open, or at least close, my office door. I have a spare <a href='https://en.wikipedia.org/wiki/Raspberry_Pi'>Raspberry Pi Zero W</a> and some related parts so that’s a start. I’ve also just purchased a little <a href='https://www.amazon.com/gp/product/B07252J5GV/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&amp;psc=1'>High-Torque DC Motor</a> and a RPI-compatible <a href='https://www.amazon.com/gp/product/B01MQ2MZDV/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&amp;psc=1'>motor controller</a>.</p><h2 id='web-resources'>Web Resources</h2><p>This post captures the resources I’ll use (or used, depending on when you read this) to set my plan in motion. The first step, my <a href='https://www.one-tab.com/help'>OneTab</a> that holds my initial web resources: <a href='https://www.one-tab.com/page/0fj_WcQ0TkG256iDV3EE2g'>https://www.one-tab.com/page/0fj_WcQ0TkG256iDV3EE2g</a>.</p><h2 id='my-build'>My Build</h2><p>Check here for some follow-up soon, I hope.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1588982400
      }

,
      
      {
        "id": "7",
        "title": "Westbound to Seattle - Day 2",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='day-2---glendive-mt-to-moses-lake-wa'>Day 2 - Glendive, MT to Moses Lake, WA</h1><p>This is our planned route for Day 2 using a <code>speed factor of 1.0</code> (traveling at the speed limit).  Fuel cost is based on <code>40 mpg</code> and <code>$4.00 per gallon</code> averages.  Fuel stops typically have a 15-minute duration and rest areas allow 5-minutes each.</p><p>A list of possible geocache targets for the entire route can be found at <a href='https://www.geocaching.com/play/map/lists/BMBBMD6'>https://www.geocaching.com/play/map/lists/BMBBMD6</a>.</p><iframe src='http://localhost:1313/html/Westbound-Day-2.html' style='width: 100%; height: 400px; border:1;' title='Westbound Day 2'></iframe></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1659830400
      }

,
      
      {
        "id": "8",
        "title": "CentOS 7 Remote Using VNC",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>This past weekend I managed to get a <em>VNC</em> server running on my <strong>centos7</strong> node, where I run <em>Paperless</em>.  The build instructions came from <a href='https://www.howtoforge.com/vnc-server-installation-on-centos-7'>https://www.howtoforge.com/vnc-server-installation-on-centos-7</a>. The node is available at <code>192.168.1.22:5901</code>.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1609718400
      }

,
      
      {
        "id": "9",
        "title": "Adding Netlify CMS for Editing This Blog",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>OK, I’m using the “<em>Rich Text</em>” editor option in the body field here in my “posts” <strong>Netlify CMS</strong> form for <a href='https://blog.SummittDweller.com'>this blog</a>.  Will it work?  We shall see!</p><h2 id='yup'>Yup!</h2><p>I have to confess, this is pretty cool.  I’m even able to switch dynamically between the <em>Rich Text</em> and <em>Markdown</em> editors here!</p><h1 id='how-was-this-done'>How Was This Done?</h1><p>Let me elaborate just a bit…</p><h2 id='using-hugo'>Using Hugo</h2><p>Since this blog is published using <a href='https://gohugo.io'>Hugo</a> I looked to the Netlify CMS guidance provided at <a href='https://www.netlifycms.org/docs/hugo/'>https://www.netlifycms.org/docs/hugo/</a> for help.</p><p>First I added the requested <code>./static/admin</code> directory, and the two files required there:</p><ul><li><code>index.html</code>, and</li><li><code>config.yml</code></li></ul><h3 id='indexhtml'>index.html</h3><p>The contents of my <code>index.html</code> file is identical to what’s called for in the documentation.  Easy.  I like.</p><h3 id='configyml'>config.yml</h3><p>This file demands considerable customization, so I turned to more <em>Netlify CMS</em> documentation regarding <a href='https://www.netlifycms.org/docs/widgets'>Widgets</a> and the <a href='https://www.netlifycms.org/docs/github-backend/'>Github Backend</a> that I already use.</p><p>As a result, my <code>config.yml</code> file looks like this:</p><pre tabindex='0'><code>backend:  name: github  repo: SummittDweller/blogs-SummittDweller  branch: main media_folder: 'static/img'public_folder: /imgcollections:  - name: 'posts'    label: 'Post'    folder: 'content/posts'    create: true    slug: '{{slug}}'    path: '{{year}}/{{month}}/{{slug}}'    preview_path: '{{year}}/{{month}}/{{slug}}'    preview_path_date_field: publishDate    sortable_fields: [ 'publishDate', 'lastmod' ]    sort: 'publishDate:desc'    view_groups:      - label: Year        field: publishDate        # groups items based on the value matched by the pattern        pattern: \d{4}      - label: Drafts        field: draft    editor:      preview: true    fields:      - label: Title        name: title      - label: Body        name: body        widget: markdown       - label: Publish Date        name: publishDate        widget: date            - label: Last Mod        name: lastmod        widget: datetime      - label: Location        name: location        default: 'Toledo, IA'        required: false      - label: Weight        name: weight        height: 'Enter today's date with a leading dash, like -YYYYMMDD.'        required: true        # default: -{{year}}{{month}}{{day}}      - label: Draft Status        name: draft        widget: boolean        default: false       - label: Description        name: description        required: false      - label: Tags        name: tags        widget: list        hint: 'Enter comma separated values.'        required: false</code></pre><h2 id='simple--elegant'>Simple = Elegant</h2><p>At this moment I’m running <code>hugo server</code> on my Mac and I’m editing this post in <code>https://localhost:1313/admin</code>, basically in the <em>admin</em> page of my blog on my localhost.  Beautimous!</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1616803200
      }

,
      
      {
        "id": "10",
        "title": "A Simple Sign-up Form",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>For 2021 I’ve signed on to be a member of the steering committee for Toledo’s 2021 <a href='https://www.communityvisioning.org/toledo/'>Community Visioning (CV)</a> project coordinated by <a href='http://www.treesforever.org/IowasLivingRoadways'>Tree’s Forever and Iowa’s Living Roadways</a>, <a href='https://www.extension.iastate.edu/'>Iowa State University Extension and Outreach</a>, and other partners.  Tama is also a <a href='https://www.communityvisioning.org/tama/'>Community Visioning</a> participant in 2021.</p><h2 id='a-simple-e-mail-sign-up'>A Simple E-Mail Sign-Up</h2><p>I’m only posting this as a test of what I think might be a very simple sign-up form using email.  What you see below is just a test, so please don’t expect any invitation from this!</p><h3 id='this-form-is-for-testing-only'>This Form is for Testing ONLY!</h3><p><strong>Are you interested in helping Toledo plan for the future with regard to transportation and recreation?</strong> Click ONE of the following links to receive an invitation by email to join a 90-minute online focus group on Saturday, March 6:</p><ul><li><a href='mailto:mark.mcfate@icloud.com?subject=Toledo:Active%20Adult&amp;body=Please%20send%20this%20email%20to%20confirm%20your%20interest.%20Thank%20You!'><strong>Active Adult</strong> - 10:30am-Noon</a></li><li><a href='mailto:mark.mcfate@icloud.com?subject=Toledo:Youth&amp;body=Please%20send%20this%20email%20to%20confirm%20your%20interest.%20Thank%20You!'><strong>Youth to Age 12</strong> - Noon-1:30pm</a></li><li><a href='mailto:mark.mcfate@icloud.com?subject=Toledo:Young%20Adult&amp;body=Please%20send%20this%20email%20to%20confirm%20your%20interest.%20Thank%20You!'><strong>Young Adult Ages 13-21</strong> - 1:30pm-3pm</a></li></ul><p><em>Remember, this is just a TEST!</em></p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1614988800
      }

,
      
      {
        "id": "11",
        "title": "Eastbound from Seattle - Day 2",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='day-3---lakeview-or-to-laramie-wy'>Day 3 - Lakeview, OR to Laramie, WY</h1><p>This is our planned route for Day 2 (eastbound) using a <code>speed factor of 1.0</code> (traveling at the speed limit).  Fuel cost is based on <code>40 mpg</code> and <code>$4.00 per gallon</code> averages.  Fuel stops typically have a 15-minute duration and rest areas allow 5-minutes each.</p><p>A list of possible geocache targets for the entire route can be found at <a href='https://www.geocaching.com/play/map/lists/BMBBMD6'>https://www.geocaching.com/play/map/lists/BMBBMD6</a>.</p><iframe src='http://localhost:1313/html/Eastbound-Day-2.html' style='width: 100%; height: 400px; border:1;' title='Eastbound Day 2'></iframe></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1659916800
      }

,
      
      {
        "id": "12",
        "title": "August 2022 - Geocaching's 20th Anniversary Celebration Event",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>The following is a chronological consolidation of posts and microposts from August 6 through August 25, 2022.</p><article class='post'><h2><a href='../geocaching-westbound-day-1/index.html' rel='full-article'>Westbound to Seattle - Day 1</a></h2><div class='postmeta'>    Posted on 2022/08/07 4:57 PM          from Toledo, IA      </div></article><article class='post'><h2><a href='../geocaching-westbound-day-2/index.html' rel='full-article'>Westbound to Seattle - Day 2</a></h2><div class='postmeta'>    Posted on 2022/08/07 4:58 PM          from Toledo, IA      </div></article><article class='post'><h2><a href='../geocaching-westbound-day-3/index.html' rel='full-article'>Westbound to Seattle - Day 3</a></h2><div class='postmeta'>    Posted on 2022/08/07 4:58 PM          from Toledo, IA      </div></article><article class='post'><h2><a href='../geocaching-eastbound-day-1/index.html' rel='full-article'>Eastbound from Seattle - Day 1</a></h2><div class='postmeta'>    Posted on 2022/08/07 9:13 PM          from Toledo, IA      </div></article><article class='post'><h2><a href='../geocaching-eastbound-day-2/index.html' rel='full-article'>Eastbound from Seattle - Day 2</a></h2><div class='postmeta'>    Posted on 2022/08/08 1:39 PM          from Toledo, IA      </div></article><article class='post'><h2><a href='../geocaching-eastbound-day-3/index.html' rel='full-article'>Eastbound from Seattle - Day 3</a></h2><div class='postmeta'>    Posted on 2022/08/08 2:44 PM          from Toledo, IA      </div></article><article class='micropost'><p>  Waiting for my ride to Johnston.  <aside class='postmeta'>→ 2022/08/12 7:37 AM          posted from Toledo, IA      </aside></p></article><article class='micropost'><p>  Departed for Seattle a few minutes  after 6 AM.  <aside class='postmeta'>→ 2022/08/16 6:14 AM          posted from Montour, IA      </aside></p></article><article class='micropost'><p>  Lunch at Culver’s in Brookings, SD.  <aside class='postmeta'>→ 2022/08/16 11:52 AM          posted from Brookings, SD      </aside></p></article><article class='micropost'><p>  Got my first North Dakota geocache find a few miles back down the road.  <aside class='postmeta'>→ 2022/08/16 2:18 PM          posted from Wahpeton, ND      </aside></p></article><article class='micropost'><p>  Passing through the outskirts of metropolitan Fargo.  <aside class='postmeta'>→ 2022/08/16 3:10 PM          posted from West Fargo, ND      </aside></p></article><article class='micropost'><p>  Headed west across North Dakota for GC 551, the state’s oldest active geocache.  <aside class='postmeta'>→ 2022/08/16 5:24 PM          posted from Steele, ND      </aside></p></article><article class='micropost'><p>  Arrived for the night around 9:25 pm in Miles City, Montana, about 70 miles past our intended stop.  <aside class='postmeta'>→ 2022/08/16 9:52 PM          posted from Miles City, MT      </aside></p></article><article class='micropost'><p>  First cache of the day:  Headed to GCHGZZ in a rest area in Montana.  <aside class='postmeta'>→ 2022/08/17 6:43 AM          posted from Rosebud, MT      </aside></p></article><article class='micropost'><p>  GCKHRJ:  Was not on our original list but a really quick stop and well worth the time out.  <aside class='postmeta'>→ 2022/08/17 9:46 AM          posted from Big Timber, MT      </aside></p></article><article class='micropost'><p>  Just departed from the headwaters of the Missouri river state park in Montana and the state’s oldest pair of geocaches.  Check my track logs on <a href='https://hikes.summittdweller.com'>https://hikes.summittdweller.com</a> for more details.  <aside class='postmeta'>→ 2022/08/17 1:21 PM          posted from Headwaters of the Missouri River, Montana      </aside></p></article><article class='micropost'><p>  Stopped for dinner in Coeur d’Alene at Rogers Ice Cream and Burgers.  <aside class='postmeta'>→ 2022/08/17 6:13 PM          posted from Coeur d'Alene, ID      </aside></p></article><article class='micropost'><p>  Excellent company for the reviewers lunch after the APE geocache at Snoqualmie Pass, Washington.  <aside class='postmeta'>→ 2022/08/18 2:32 PM          posted from Snoqualmie Pass, WA      </aside></p></article><article class='micropost'><p>  Relaxing and catching up in the hotel (the Maxwell near the Space Needle) after a great day of geocaching, hiking (10 miles or more) and lite travel.  <aside class='postmeta'>→ 2022/08/18 9:46 PM          posted from Seattle, WA      </aside></p></article><article class='micropost'><p>  No time to blog!  Attending the Geocaching 20th Celebration.  <aside class='postmeta'>→ 2022/08/20 10:38 AM          posted from Seattle, WA      </aside></p></article><article class='micropost'><p>  Southbound on I5 to the Original Stash SE of Portland.  <aside class='postmeta'>→ 2022/08/21 5:55 AM          posted from Tukwila, WA      </aside></p></article><article class='micropost'><p>  Grabbing a quick lunch at McDonald’s.  <aside class='postmeta'>→ 2022/08/21 1:59 PM          posted from Madras, OR      </aside></p></article><article class='micropost'><p>  The apex of an epic road-trip!  <aside class='postmeta'>→ 2022/08/21 7:11 PM          posted from Davis Creek, CA      </aside></p></article><article class='micropost'><p>  Winnemucca ETA is 11:35pm.  Never have I seen so many stars.  <aside class='postmeta'>→ 2022/08/21 10:09 PM          posted from Denico Junction, NV      </aside></p></article><article class='micropost'><p>  Tom’s reaction when we popped over the hill to see the Bonneville salt flats was “holy shit”.  <aside class='postmeta'>→ 2022/08/22 11:22 AM          posted from West Wendover, NV      </aside></p></article><article class='micropost'><p>  Posting an <a href='../geocaching-eastbound-day-3/index.html'>updated itinerary</a> for eastbound day 3.  <aside class='postmeta'>→ 2022/08/22 7:22 PM          posted from Rawlins, WY      </aside></p></article><article class='micropost'><p>  Planning a lunch stop in Grand Island with Heartland Cacher and then on home to Iowa so Reviewer Smith can get back to Illinois this evening.  <aside class='postmeta'>→ 2022/08/23 8:42 AM          posted from North Platte, NE      </aside></p></article></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1664064000
      }

,
      
      {
        "id": "13",
        "title": "My Hugo Timeline, A New Hugo Module",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>What follows is an excerpt from this blog’s <code>README.md</code> file.</p><p>I’ve successfully added the code to drive a new <code>/timeline</code> page as part of this blog, but I did so “locally”, and now I’d like to repeat the process but using the aforementioned <a href='https://github.com/SummittDweller/hugo-timeline'>SummittDweller/hugo-timeline</a> <a href='https://gohugo.io/hugo-modules/'>module</a>.</p><p>I used guidance found in <a href='https://scripter.co/hugo-modules-getting-started/'>Hugo Modules: Getting Started</a> to make this happen, like so:</p><pre tabindex='0'><code>╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main› ╰─$ brew install go╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main› ╰─$ brew upgrade   # This is not 'required', but probably overdue.╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ mkdir content/timeline/.out-of-the-way      # vvv Moving existing local stuff out of the way vvv╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ mv -f layouts/partials/hugo-timeline* content/timeline/.out-of-the-way/.   ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ mv -f layouts/shortcodes/hugo-timeline* content/timeline/.out-of-the-way/.╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ mv -f static/css/hugo-timeline* content/timeline/.out-of-the-way/.        ╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ hugo mod init github.com/SummittDweller/blogs-SummittDweller        go: creating new go.mod: module github.com/SummittDweller/blogs-SummittDwellergo: to add module requirements and sums:        go mod tidy</code></pre><p>Next, to pull in <a href='https://github.com/SummittDweller/hugo-timeline'>SummittDweller/hugo-timeline</a> as a module I turned to the <code>config.yml</code> file and guidance found in <a href='https://www.thenewdynamic.com/article/hugo-modules-everything-from-imports-to-create/'>Hugo Modules: everything you need to know!</a>.  Additions to <code>config.yml</code> are:</p><div class='highlight'><pre style='background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;' tabindex='0'><code class='language-yml' data-lang='yml'><span style='display:flex;'><span><span style='color:#008000;font-weight:bold'>module</span>:<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>  </span><span style='color:#008000;font-weight:bold'>imports</span>:<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>    </span>- <span style='color:#008000;font-weight:bold'>path</span>:<span style='color:#bbb'> </span>github.com/SummittDweller/hugo-timeline<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>      </span><span style='color:#008000;font-weight:bold'>mounts</span>:<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>      </span>- <span style='color:#008000;font-weight:bold'>source</span>:<span style='color:#bbb'> </span>layouts<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>        </span><span style='color:#008000;font-weight:bold'>target</span>:<span style='color:#bbb'> </span>layouts<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>      </span>- <span style='color:#008000;font-weight:bold'>source</span>:<span style='color:#bbb'> </span>static<span style='color:#bbb'></span></span></span><span style='display:flex;'><span><span style='color:#bbb'>        </span><span style='color:#008000;font-weight:bold'>target</span>:<span style='color:#bbb'> </span>static<span style='color:#bbb'></span></span></span></code></pre></div><h3 id='updating-the-module'>Updating the Module</h3><p>So, all of the above moves appeared to work correctly, at least locally, but I wanted to be sure I can successfully update the <code>hugo-timeline</code> module and get updated behavior in this project.  The command required to make that happen per <a href='https://www.thenewdynamic.com/article/hugo-modules-everything-from-imports-to-create/#upgrading'>Hugo Modules: everything you need to know!</a> is:</p><pre tabindex='0'><code>╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ hugo mod get -u github.com/SummittDweller/hugo-timelinego: downloading github.com/SummittDweller/hugo-timeline v0.0.0-20221206191252-cd7178e7e43bgo: upgraded github.com/SummittDweller/hugo-timeline v0.0.0-20221206043330-5f1ecbad913f =&gt; v0.0.0-20221206191252-cd7178e7e43b╭─mark@Marks-Mac-Mini ~/GitHub/blogs-SummittDweller ‹main*› ╰─$ hugo serverport 1313 already in use, attempting to use an available portStart building sites … hugo v0.107.0+extended darwin/amd64 BuildDate=unknown                   | EN   -------------------+------  Pages            | 288    Paginator pages  |   9    Non-page files   |   0    Static files     |  38    Processed images |   0    Aliases          |  79    Sitemaps         |   1    Cleaned          |   0  Built in 90 msWatching for changes in /Users/mark/GitHub/blogs-SummittDweller/{archetypes,content,layouts,static,themes}Watching for config changes in /Users/mark/GitHub/blogs-SummittDweller/config.yaml, /Users/mark/GitHub/blogs-SummittDweller/go.modEnvironment: 'development'Serving pages from memoryRunning in Fast Render Mode. For full rebuilds on change: hugo server --disableFastRenderWeb Server is available at //localhost:62846/ (bind address 127.0.0.1)Press Ctrl+C to stop</code></pre><p>Eureka!  The page rendered at <code>http://localhost:1313/timeline/</code> after the above <code>hugo mod get -u...</code> command is displaying the latest changes I made to <code>hugo-timeline</code>!  Perfect!</p><p><strong>My work here is done, well, for now anyway.</strong>   😁</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1670284800
      }

,
      
      {
        "id": "14",
        "title": "Migrating the Wieting Site in Drupal 8",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='migrating-the-wieting-site-in-drupal-8'>Migrating the Wieting Site in Drupal 8</h1><p>Sorry for my extended absence here, I’ve been uber-busy with work, but have also been able to work a little (lots of long nights and weekends) on a long-overdue update of <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a> in <em>Drupal 8</em>.  It’s true, I have been thinking about moving that site to make it static, almost certainly using <em>Hugo</em>, but I thought before doing so I’d give <em>Drupal 8</em> one more try.  I’m pleased to report that it’s working nicely again.  Here’s how I did it, and how I plan to keep it updated…</p><h2 id='saved-by-docker-compose-drupal'>Saved by “docker-compose-drupal”</h2><p>I actually started the process of migrating and updating <a href='https://wieting.tamatoledo.com'>the Wieting website</a> in <em>Docksal</em>, but I failed… I could never figure out how to reliably and easily push my work to production from there.  <em>Docksal</em> just seems to wrap so much of itself into the <code>cli</code> container that drives it, I found it difficult to de-couple from that in production.</p><p>So I went looking elsewhere and discovered <a href='https://devwithlando.org'>Lando</a>, and I did considerable work with it because <em>Lando</em>, at least in the case of <em>Drupal</em>, builds a 3-part development stack that looks a lot like what I wanted to deploy in production.  The parts of a <em>Lando</em> stack, and my production stack, are the same:</p><ul><li>An <code>nginx</code> web server container,</li><li>A <code>mysql</code> or <code>mariadb</code> database container, and</li><li>A <code>php</code> codebase container.</li></ul><p>But once again I had trouble figuring out exactly how to push that development stack to production.  So, I went looking again for an open (and by that I mean “free” and freely modifiable) production-ready stack configuration that uses the 3-parts I had in mind.  I found <a href='https://github.com/mogtofu33/docker-compose-drupal'>docker-compose-drupal</a> and almost immediately created <a href='https://github.com/SummittDweller/docker-compose-drupal'>my own fork</a> of that project. Using <a href='https://github.com/SummittDweller/docker-compose-drupal'>my <code>docker-compose-drupal</code> fork</a> I set off to build a production instance, NOT a development instance, on my <code>summitt-dweller-DO-docker</code> droplet at <em>DigitalOcean</em>.  That project came to life in <code>/opt/docker-compose-drupal</code> there.</p><p>The evolution of <code>summitt-dweller-DO-docker:/opt/docker-compose-drupal</code> was quite an adventure, in large part because the <em>Wieting’s</em> web site had gone almost a year without any updates.  That meant upgrading the <em>Drupal</em> core from version 8.2.? to version 8.8.2, along with countless modules that had changed rather dramatically, so there were lots of bumps along the way.  I also had to move the site from a multi-site configuration, the old site lived in a container at <code>/var/www/html/web/sites/wieting</code>, to a <em>default</em> configuration that lives in the container at <code>/var/www/localhost/web/sites/default</code>.</p><p>Fortunately, <a href='https://github.com/mogtofu33/docker-compose-drupal'>docker-compose-drupal</a> includes some nice scripts and features to help with things like that, and they are nicely documented in the <a href='https://github.com/mogtofu33/docker-compose-drupal/blob/master/README.md'>project’s README.md</a> file.  I’ll elaborate on a few of the key features later in this post, but most of what I did during the migration and update is water-under-the-bridge, and should not need to be repeated, ever, so I won’t elaborate on all of it here.  It’s worth noting here that the work I did in my fork all happened in a branch named <code>wieting</code>.</p><h2 id='moved-to-wieting-d8-do'>Moved to “wieting-D8-DO”</h2><p>Once I had a new site working as I’d hoped, I wanted to begin a fresh new development and update cycle, so I used a process I’ve documented in my work blog: <a href='https://static.grinnell.edu/blogs/McFateM/posts/065-create-new-github-project-from-a-branch/'>“How to Create a New GitHub Repo from an Existing Branch”</a>. That work created the <em>Wieting</em> site’s new home, <a href='https://github.com/SummittDweller/wieting-D8-DO'>https://github.com/SummittDweller/wieting-D8-DO</a>, based on the <em>wieting</em> branch of the aforementioned fork of <em>docker-compose-drupal</em>.</p><h2 id='site-update-workflow'>Site Update Workflow</h2><p>Having built the <a href='https://github.com/SummittDweller/wieting-D8-DO'>wieting-D8-DO</a> project I need a reliable workflow that I could use to keep it up-to-date.  I created that workflow by migrating the existing production site at <code>summitt-dweller-DO-docker:/opt/docker-compose-drupal</code>, where it responded as <em><a href='https://Wieting.TamaToledo.org'>https://Wieting.TamaToledo.org</a></em>, to a new staging copy at <code>summitt-dweller-DO-docker:/opt/wieting-D8-DO</code>, where it would respond, temporarily, at my designated “staging” address, <em><a href='https://Wieting.SummittServices.com'>https://Wieting.SummittServices.com</a></em>.</p><p>While working as <em>administrator</em> on <code>summitt-dweller-DO-docker</code> the entire command-line process looked like this:</p><pre tabindex='0'><code>echo $(date --iso-8601)cd /opt/docker-compose-drupalgit ls-files --others --ignored --exclude-standard &gt; $(date --iso-8601).ignored.listtar czvf $(date --iso-8601).ignored.list.tar.gz --files-from $(date --iso-8601).ignored.listgpg --encrypt --recipient summitt.dweller@gmail.com $(date --iso-8601).ignored.list.tar.gzrm -fr $(date --iso-8601).ignored.list.tar.gzcd /optgit clone https://github.com/SummittDweller/wieting-D8-DO.gitcd wieting-D8-DOcp -f ../docker-compose-drupal/2020-02-27.ignored.list.tar.gz.gpg .gpg --decrypt 2020-02-27.ignored.list.tar.gz.gpg &gt; ignored.tar.gztar xzvf ignored.tar.gzrm -f ignored.tar.gzcd ../docker-compose-drupalscripts/mysql dumpmv -f database/dump/dump.sql /opt/wieting-D8-DO/database/mysql-initcd /opt/wieting-D8-DOnano .envnano docker-compose.ymldocker-compose up -d</code></pre><h3 id='breaking-the-workflow-down'>Breaking the Workflow Down</h3><p>Moving the site from <code>/opt/docker-compose-drupal</code> and <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a>, to <code>/opt/wieting-D8-DO</code> and <a href='https://Wieting.SummittServices.com'>https://Wieting.SummittServices.com</a> is a command-line process like this, with comments…</p><table><thead><tr><th>Comments / Commands</th></tr></thead><tbody><tr><td># Set the working directory to the server’s project root, then <code>git clone</code> the <em>wieting-D8-DO</em> project.<br/> <code>cd /opt</code> <br/> <code>git clone https://github.com/SummittDweller/wieting-D8-DO.git</code></td></tr><tr><td># Save today’s date in ISO 8601 format to <code>${today}</code>; we will use it a few times later on. <br/> <code>today=$(date --iso-8601)</code></td></tr><tr><td># Set working directory to the initial project. Put the site into ‘maintenance_mode’, flush all caches, dump a copy of the project’s database, move previously dumped databases to an <em>.inactive</em> directory, and move the dumped database so it will initialze the new site upon startup. <br/> <code>cd /opt/docker-compose-drupal</code> <br/> <code>scripts/drush sset system.maintenance_mode 1 --input-format=integer</code> <br/> <code>scripts/drush cr</code> <br/> <code>scripts/mysql dump -f dump_${today}.sql</code> <br/> <code>mv -f /opt/wieting-D8-DO/database/mysql-init/*.sql /opt/wieting-D8-DO/database/mysql-init/.inactive/</code> <br/> <code>mv -f database/dump/dump_${today}.sql /opt/wieting-D8-DO/database/mysql-init/</code></td></tr><tr><td># Fetch a list of ignored files, then <em>tar</em> the ignored files to make an archive, and encrypt the tarball for security purposes, then remove the itermediate tarball. <br/> <code>git ls-files --others --ignored --exclude-standard &gt; ${today}.ignored.list</code> <br/> <code>tar czvf ${today}.ignored.list.tar.gz --files-from ${today}.ignored.list</code> <br/> <code>gpg --encrypt --recipient summitt.dweller@gmail.com ${today}.ignored.list.tar.gz</code> <br/> <code>rm -fr ${today}.ignored.list.tar.gz</code></td></tr><tr><td># Now set the working directory to the new project, copy the tarball from the old site to the new one, decrypt and then restore/extract the tarball contents, and finally, remove the intermediate tarball. <br/> <code>cd /opt/wieting-D8-DO</code> <br/> <code>cp -f ../docker-compose-drupal/${today}.ignored.list.tar.gz.gpg .</code> <br/> <code>gpg --decrypt ${today}.ignored.list.tar.gz.gpg &gt; ignored.tar.gz</code> <br/> <code>tar xzvf ignored.tar.gz</code> <br/> <code>rm -f ignored.tar.gz</code></td></tr><tr><td># Working in the new directory, edit the <em>.env</em> file to set <code>PROJECT_NAME</code>, <code>NGINX_HOST_HTTP_PORT</code> and <code>NGINX_HOST_HTTPS_PORT</code> that won’t conflict with existing names. <br/> <code>nano .env</code></td></tr><tr><td># Still in the new directory, edit the <em>docker-compose.yml</em> file to set the <em>nginx</em> service <code>labels:</code> to include  <code>traefik.frontend.rule=Host:wieting.SummittServices.com</code>, to properly address the new site. <br/> <code>nano docker-compose.yml</code></td></tr><tr><td># Spin up the new site for testing. <br/> <code>docker-compose up -d</code></td></tr><tr><td># Turn off ‘maintenance_mode’ in both sites. <br/> <code>/opt/docker-compose-drupal/scripts/drush sset system.maintenance_mode 0 --input-format=integer</code> <br/> <code>/opt/wieting-D8-DO/scripts/drush sset system.maintenance_mode 0 --input-format=integer</code></td></tr></tbody></table><p>That worked nicely!  Time to end this saga, but I’ll return shortly, in another post, to document my workflow for ongoing maintenance and updates.  Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1582848000
      }

,
      
      {
        "id": "15",
        "title": "Derecho Follow-Up - Saturday, August 22",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Almost every day for the past few months I have walked with my “scurry” around Cherry Lake in Tama. We generally walk in the morning before the heat, humidity, and mosquitoes get too bad.  We finally got power back on Thursday evening, August 20, so on Friday morning, August 21, 2020, we walked for the first time since the derecho of August 10. It was actually more like an obstacle course than our usual stroll, but we still managed to collect quite a bit of trash, as usual. There were about a dozen places around the lake, a trail that is about 1.33 miles long, where fallen trees required that we climb over or weave around. It’s no fun to do either, especially since the “weaving” sometimes involved venturing off-trail into the poison ivy. Makes me itch just thinking about it.</p><p>At the west end of Cherry Lake I placed a bench and engraved rock as a memorial for my parents, and my son, Ian. The most recent, pre-derecho photo of the rock and bench was taken on a “scurry” walk around the lake early this Spring. Portions of scurry-partners Jeff Shaw, and the hind-quarters of four-legged scurry member, Titan Edward, can be seen in this photo from that excursion.</p><p><figure><img alt='McFate Memorial Bench at Cherry Lake - Early Spring 2020' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0121.png'/><figcaption>McFate Memorial Bench at Cherry Lake - Early Spring 2020</figcaption></figure></p><p>On the south side of the lake – visible in the background of the photo above – the trail runs parallel to a road that leads to a brush pile where Tama residents can dump tree limbs, brush and leaves collected from their yard.  There’s been a LOT of that lately! On this occasion a friend of our, Charlie Betz, was hauling a pickup-load of derecho debris to the brush pile and stopped briefly to chat. Charlie suggested that someday soon he would return with his chainsaw to begin clearing deadfall from the trail. We told him to let us know when, and we’d see if we could come help.  Well, that “when” was 7 AM the next day, Saturday, August 22.</p><p>I arrived at the lake at 7 AM on the 22nd and found Charlie already there, preparing to fire up his saw. I brought my little 10' Ryobi cordless electric chainsaw and two fully-charged batteries. Jeff Shaw arrived about 20 minutes later and we proceeded to work our way counter-clockwise around the lake trail startring from the parking area on the east end of the lake.  It was slow going, especially at first since the north side of the lake is, or was, densely wooded with some mature trees.</p><p>After three hours of cutting and tossing debris to the side of the trail, we reached my family’s memorial bench at the west end of the lake.</p><p><figure><img alt='McFate Memorial Bench at Cherry Lake - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0324.png'/><figcaption>McFate Memorial Bench at Cherry Lake - After the Derecho</figcaption></figure></p><p>By this time we had waded through way too much PI, been briefly rained on, dulled Charlie’s chainsaw blade, and drained both of the saw batteries I had on hand. I think we were drained too. Time for a break, so at 10 AM we departed for some rest, lunch, fresh batteries, and hopefully a new chain for Charlie’s saw. We reconvened at Noon, as planned, and spent the next two hours clearing the deadfall around the McFate bench, plus a pair of gnarly monsters that had fallen across the trail near the southeast corner of the lake.</p><p>It felt really good to get it all done, and now we can engage in our “scurry” walks around the lake without all the bobbing and weaving required to navigate the obstacle course that was.  Every good volunteer effort should conclude with a photo or two, so we got all cleaned up, NOT, and I shot this one.</p><p><figure><img alt='The Post-Derecho Cherry Lake Trail Cleanup Crew - Me, Charlie, and Jeff' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0325.png'/><figcaption>The Post-Derecho Cherry Lake Trail Cleanup Crew - Me, Charlie, and Jeff</figcaption></figure></p><p>That’s a warp. Until next time… but only after I’ve had a pleasant scurry walk in the morning.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1598054400
      }

,
      
      {
        "id": "16",
        "title": "Eastbound from Seattle - Day 3",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='day-3---laramie-wy-to-grinnell-ia'>Day 3 - Laramie, WY to Grinnell, IA</h1><p>This is our planned route for Day 3 (eastbound) using a <code>speed factor of 1.0</code> (traveling at the speed limit).  Fuel cost is based on <code>40 mpg</code> and <code>$4.00 per gallon</code> averages.  Fuel stops typically have a 15-minute duration and rest areas allow 5-minutes each.</p><p>A list of possible geocache targets for the entire route can be found at <a href='https://www.geocaching.com/play/map/lists/BMBBMD6'>https://www.geocaching.com/play/map/lists/BMBBMD6</a>.</p><iframe src='http://localhost:1313/html/Eastbound-Day-3.html' style='width: 100%; height: 400px; border:1;' title='Eastbound Day 3'></iframe></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1659916800
      }

,
      
      {
        "id": "17",
        "title": "Time for a Test Page",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>My daughter, Mackenzie, and I have been using this blog for testing new features lately. If you’ve been following me here you’ve seen some of them pop-up on the home page. Now that we have a host of them working, I need to move some out–of-the-way so they don’t clutter things up too much.  However, I don’t want to discard them, in some cases we didn’t implement them anywhere else so this is the only <em>working</em> copy we have.</p><p>So, this morning I found a post at <a href='http://localhost:1313/posts/2021/03/time-for-a-test-page/%5Bhttps://formcake.com/'>formcake</a>, titled <a href='https://formcake.com/blog/adding-a-single-page-to-hugo'>How to add a Static Page to Hugo</a> by Joe Marshall.  I’m going to follow Joe’s lead and try to add a static “Testing” page here. If I’m successful, it will become the new home for 3 features (and maybe more in the future), specifically:</p><ul><li>A <em>markdown</em> (.md) file fetched from Dropbox,</li><li>A summary of my public gists, and</li><li>My latest <em>Tweet</em>, with automatic, timed expiration.</li></ul><p>These three features currently look like this on my home page:</p><figure><img src='http://localhost:1313/img/Hugo-features-03-07-2021.png'/><figcaption><h4>3 Features, Time for a New Home</h4></figcaption></figure><h2 id='it-worked-almost'>It Worked, Almost</h2><p>I did indeed manage to make this work, but not quite as Joe proposed. I found that in <a href='https://formcake.com/blog/adding-a-single-page-to-hugo'>How to add a Static Page to Hugo</a> there’s some confusion around the name of the <code>.html</code> file that Joe calls for. In at least one place the file is named <code>/layouts/_default/singlepage.html</code>, but in fact the file should be named <code>/layouts/_default/staticpage.html</code>.</p><p>The other issue I encountered was my fault. My implementation of this “testing” page means that I need to include not just text or markdown content, I also need quite a bit of code, mostly Javascript. So, in my case I duplicated the <code>/layouts/_default/staticpage.html</code> template, calling it <code>/layouts/_default/testpage.html</code>.  My <code>code</code> appears in this new template file. I also changed the content “type” in the frontmatter of <code>/content/testing.md</code> from “staticpage” to “testpage”.  And voilá…</p><h2 id='it-just-works'>It Just Works!</h2><p>You can find the results on my <a href='https://blog.summittdweller.com/testing/'>Testing Page</a>. Enjoy.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1615075200
      }

,
      
      {
        "id": "18",
        "title": "New Announcement Feature",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Quite some time ago I added an <strong>Announcement</strong> feature to the <a href='https://rootstalk.grinnell.edu'>Rootstalk</a> website that I helped design and maintain for <a href='https://grinnell.edu'>Grinnell College</a>. Events of the past week have driven me to implement this feature as part of this blog and one other site, with some minor improvements.</p><p>The original <a href='https://rootstalk.grinnell.edu'>Rootstalk</a> version of the feature is very simple, it works around this logic:</p><ul><li>The site’s <code>content/_index.html</code> page invokes a shortcode named <code>announcement.html</code>.</li><li>The <code>announcement.html</code> shortcode checks for existence of a file path of <code>static/announcement.md</code>.</li><li>If the <code>static/announcement.md</code> file exists, its <em>markdown</em> content is read and displayed prominently on the home page.</li></ul><p>Removing or disabling the announcement is as simple as deleting the file, or simply changing the filename to something like <code>static/.announcement.md</code>, and republishing the site.</p><h2 id='implemented-for-the-compass-rose-band'>Implemented for the Compass Rose Band</h2><p>My brother-in-law, the founder and lead-singer for the <a href='https://compassroseband.net'>Compass Rose Band</a>, out of greater metropolitan Cedar Rapids, fell ill, and literally fell down the stairs, on Thursday evening, September 10, 2020.  Since my daughter publishes the aforementioned <a href='https://compassroseband.net'>CRB</a> website, we wanted to alert their fans that the show set for Friday evening, September 11, would be canceled. We immediately thought of the <a href='https://rootstalk.grinnell.edu'>Rootstalk</a> <strong>Announcement</strong> feature and subsequently implemented it for the <a href='https://compassroseband.net'>CRB</a> site.</p><p>In the case of <a href='https://compassroseband.net'>CRB</a> the feature is implemented just a little differently:</p><ul><li>Instead of a shortcode the <code>layouts/index.html</code> file includes a new block of code that looks for a file named <code>content/announcement.md</code>.</li><li>If the file exists, its <em>markdown</em> content is prominently displayed with an orange border near the top of the home page.</li></ul><p>Removing or disabling the announcement is just like in <a href='https://rootstalk.grinnell.edu'>Rootstalk</a>, we delete or change the filename to something like <code>content/.announcement.md</code>, and republish the site.</p><h2 id='implemented-here-in-this-blog'>Implemented Here In This blog</h2><p>Since I’m essentially documenting the new feature here, I thought it only prudent to also implement it here, and that implementation is currently <strong>identical</strong> to what we did for the <a href='https://compassroseband.net'>CRB</a>.</p><p>So watch the top of this blog’s home for prominent announcements in the future, hopefully none that report dire emergencies. 😃</p><p>That’s a warp. Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1599955200
      }

,
      
      {
        "id": "19",
        "title": "How MY Web Works",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>I’ve been building websites and apps for a lot of years now, and over time I’ve used a plethora of different frameworks and tools to do so.  I’ve also involved a number of registrars, DNS strategies, source code repositories, and web hosts… frankly too many to remember or even count.</p><p>In my old age I’d love to have a dynamic document, or two, where I can track things like this:</p><h3 id='for-websites'>For Websites:</h3><ul><li>the site’s purpose</li><li>the site’s address and aliases</li><li>the domain registrar</li><li>the DNS host and site’s record structure</li></ul><h3 id='for-apps'>For Apps:</h3><ul><li>the application’s purpose</li><li>the application’s web address (if deployed to the web)</li><li>a link to the application’s user guide or instruction</li></ul><h3 id='for-both-sites-and-apps'>For Both Sites and Apps:</h3><ul><li>the programming language(s) used</li><li>the location of the code repository</li><li>a link to development and deployment guidance</li></ul><h1 id='mackenzies-project'>Mackenzie’s Project</h1><p>I feel like I’m a little too close to this material and perhaps my memory is clouded by too much outdated documentation to accurately determine where things stand today.  So, I’m asking my daughter, Mackenzie, to look at the artifacts I can provide and piece together this document for me.</p><h2 id='some-background-research'>Some Background Research</h2><p>I’ll start by asking Mackenzie to find, share, and document some resources to help her understand how to identify and document the working parts of my sites and apps… discovering how the web works, and more.</p><p>Let’s begin with a short list of documents/pages to help in that regard:</p><ul><li><a href='https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/How_the_Web_works'>How the web works</a></li><li><a href='https://www.freecodecamp.org/news/how-the-web-works-a-primer-for-newcomers-to-web-development-or-anyone-really-b4584e63585c/'>How the Web Works: A Primer for Newcomers to Web Development (or anyone, really)</a></li><li><a href='https://www.paperstreet.com/blog/domains-registrars-name-servers-and-dns-oh-my/'>Understanding Basics of Domains, Registrars, Name Servers and DNS</a></li><li><a href='https://www.paperstreet.com/blog/how-domains-name-servers-dns-and-websites-work/'>How Domains, Name Servers, DNS and Websites Work</a></li></ul><p>Some “formal” educational materials:</p><ul><li><a href='https://www.codecademy.com/learn/deploy-a-website'>How to Deploy a Website</a></li></ul></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1669766400
      }

,
      
      {
        "id": "20",
        "title": "Tama-Toledo Parks - Derecho Follow-Up for August 24",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>So, the <a href='https://iowageocachers.org'>Iowa Geocacher’s Organization</a> annual <a href='https://coord.info/GC8TJ9F'>Hike-n-Seek</a> event is coming to Tama County and Otter Creek Lake on Friday-Sunday, September 25-27, barring any more 2020 disasters. 🍀 The weekend is slated to include September’s Friday Lunch Club (FLC) too, but the restaurant that was slated to host FLC was destroyed in the August 10 derecho.</p><p>This morning <a href='https://www.geocaching.com/p/default.aspx?guid=77b132a8-363f-4989-97d0-8e44db236ada&amp;wid=caae59c7-5c17-43b9-a980-98d6c1a7d7da&amp;ds=2'>The FLC Committee</a>, aka Borky00, aka Bill, asked me about possible outdoor park settings for FLC as a means of giving folks plenty of room for social distancing. Bill mentioned a couple of possibilities including a Tama city park on east 4th Street, and the Lincoln Highway Bridge park at the intersection of 5th Street and old US Highway 30.</p><p>The city park on east 4th Street is a no-go. There’s never been much in the way of facilities there, and after the storm there is literally nothing there. I did have three other possibilities in mind, and needed to check up on them after the storm anyway, so I took a few minutes this morning to gather some information.</p><h2 id='lincoln-highway-bridge-park---east-5th-street-in-tama'>Lincoln Highway Bridge Park - East 5th Street in Tama</h2><p>This little park, and I do mean little, features two very small shelters but NO grills for cooking. It’s a small outdoor meeting place near Tama’s iconic Lincoln Highway Bridge, and home to a couple of my own geocache hides.  Here’s what it looks like after the storm.</p><p><figure><img alt='Lincoln Highway Bridge Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0331.png'/><figcaption>Lincoln Highway Bridge Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Lincoln Highway Bridge Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0330.png'/><figcaption>Lincoln Highway Bridge Park - After the Derecho</figcaption></figure></p><h2 id='tama-city-park---near-17th-street-and-mclelland-in-tama'>Tama City Park - Near 17th Street and Mclelland in Tama</h2><p>This is Tama’ primary park and I’d heard it was cleaned up right after the storm, but there’s still LOTs of damage here and lots more cleanup to be done. Also, there’s only a fireplace in the small shelter, and no grills left on the grounds, at least none that I could see.</p><p><figure><img alt='Tama City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0332.png'/><figcaption>Tama City Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Tama City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0333.png'/><figcaption>Tama City Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Tama City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0334.png'/><figcaption>Tama City Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Tama City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0335.png'/><figcaption>Tama City Park - After the Derecho</figcaption></figure></p><h2 id='toledo-heights-city-park---west-side-of-toledo-on-old-us-30'>Toledo Heights City Park - West Side of Toledo on Old US 30</h2><p>I think this is probably our best bet, assuming the City of Toledo can get the major debris taken care of before the FLC event. I just called the city and spoke with the City Clerk, she made a tentative reservation for me to have the shelter on Friday, September 25 for a reservation fee of $25. There is normally a $50 refundable deposit required but that’s being waved because the restroom in the shelter is not open due to the pandemic.</p><p>This park, about 1/2-mile west of the restaurant that FLC previously booked, has one nice large open shelter with a fireplace, AND two large grills just north of the shelter.  Have a look, and note that the park is currently not reserved for any other events on Hike-n-Seek weekend.</p><p><figure><img alt='Toledo Heights City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0327.png'/><figcaption>Toledo Heights City Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Toledo Heights City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0328.png'/><figcaption>Toledo Heights City Park - After the Derecho</figcaption></figure></p><p><figure><img alt='Toledo Heights City Park - After the Derecho' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0329.png'/><figcaption>Toledo Heights City Park - After the Derecho</figcaption></figure></p><p>That’s a warp. Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1598227200
      }

,
      
      {
        "id": "21",
        "title": "Pandemic Pastime: Walking and Picking Up Trash",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>It’s been far too long since I posted to this blog; I guess I’ve been busy? Nah, not any more than usual, but during the COVID-19 pandemic I have doubled my efforts to get out and walk in the fresh air whenever possible. I’m thankful for my small “scurry” – that’s the term for a collective of squirrels – who not only take walks with me around Cherry Lake, but all around town.</p><p>About three months ago there was some vandalism at Cherry Lake, and there was a time when folks were leaving lots of trash around the lake.  So our scurry started carrying “<a href='https://ungerconsumer.com/product/36-nifty-nabber/'>Niffty Nabbers</a>” and now we clean up what we can as we walk.  We have even extended the practice beyond the lake, and we generally walk twice a day now, most evenings somewhere in Tama or Toledo away from all the mosquitoes that inhabit Cherry Lake. True to form, we pick up trash as we go.</p><p>I would estimate that both solo and with my scurry, I/we have picked up about 100 pounds of trash so far.</p><p>This past weekend I was thinking… now that we have expaned to more than just Cherry Lake, it would be nice to plot our routes walked somewhere online so that we can keep track of progress, and see where we haven’t been yet. Fortunately, I tend to activate a “workout” recording on my Apple Watch whenever we go out, and I just realized that those routes can be exported from my iPhone as .gpx files.  So, one day soon I hope to create a new section in this blog where I can post records, with maps, of our excursions. Look for it in this blog soon, or at least sooner or later.</p><p>That’s a wrap. Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1596412800
      }

,
      
      {
        "id": "22",
        "title": "Iowa's 2020 Hurricane",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>It’s been far too long, again, since I posted to this blog, but this time I have a legitimate excuse: we’ve been without power or internet, or much of anything, since about 11:45 AM on Monday, August 10, 2020.  So we have now been more than 10.5 days without power. I’m only able to post this because of a portable generator I bought on August 12 (that was an adventure in itself) and the wireless hotspot that my phone has provided almost 24/7 ever since the storm hit.</p><p>Update: Power was finally restored here at about 6:30 PM, on Thursday, August 20, 2020.  Now I just have 11.5 days of things to catch up on!</p><h2 id='preamble'>Preamble</h2><p>The preamble to this story dates back to Christmas 2019, when my daughter gave me a “Dad’s Love…” daily calendar. There have been a couple of dates I kept because they are so accurate, like the day that says “We child-proofed the house but somehow they still got in.”  😄  Tama County has been in the grips of a moderate-to-severe drought for the past couple of months so the calendar page for August 10 looked like another “keeper”. It says:</p><p><figure><img alt='Monday, August 10, &amp;ldquo;Dad&amp;rsquo;s Love&amp;hellip;&amp;rdquo; Calendar' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Photo-2020-08-18-09-54.jpg'/><figcaption>Monday, August 10, 'Dad's Love...' Calendar</figcaption></figure></p><h2 id='930-am---scurry-walk'>9:30 AM - Scurry Walk</h2><p>This story begins in earnest around 9:30 AM on Monday, August 10, 2020.  My “scurry” and I were just completing a quick walk around Cherry Lake where we had picked up a little trash, as we usually do. We met a couple of neighbors out for a walk and chatted briefly about the weather, and I suggested that the line of storms now in western Iowa looked like they might just hold together. Every weather system thus far in the summer had passed either just to our north, just to the south, or formed just to the east, so the neighbors just scoffed at the notion of us getting any rain. I was so sure it would rain this time that I didn’t hesitate to put a concrete block on the west-half of my hot tub cover to keep it closed in case of wind. I guess I should have used all eight blocks this time?  😕</p><h2 id='1145-am---the-wind'>11:45 AM - The Wind</h2><p>The storms did indeed “hold together”.  Oh boy, did they ever.  A wall of wind hit Tama-Toledo at about 11:45 AM that morning, with literally NO warning from the US Weather Service. I had received alerts from the WeatherBug app on my iPhone, but there was no “official” word of impending doom.  The rain didn’t begin until 5 or 10 minutes later, and I’m not sure any hit the ground because EVERYTHING, tree limbs, mailboxes, small animals, etc., was moving sideways. The power went out moments later. It’s still out as of this writing, a little more than 10 days since.</p><h2 id='1155-am---get-the-cats'>11:55 AM - Get the Cats!</h2><p>After hustling to the basement and realizing the house was not gone, yet, we thought we’d better go back upstairs to get some candles, more flashlights, and our three cats.  Mackenzie and I managed to get two of the cats pretty easily, but the third one was stubborn and had to be “captured”.  While we were doing this I glanced out the window and saw nothing but tree limbs, still sailing past the windows on a nearly horizontal trajectory.</p><p>By the time we captured the last cat I thought to myself, the wind can’t last much longer…it had been blowing for at least 5 minutes straight, and I do mean STRAIGHT. I was very wrong.  Thinking back, I do believe the wind blew at upwards of 100 MPH or more for at least 20 minutes.</p><h2 id='1158-am---morgans-story'>11:58 AM - Morgan’s Story</h2><p>My daughter, Morgan, had been at the STC Middle School in Toledo working on getting her classroom ready for the start of school. She got a call from a friend in Des Moines at about 11:30 AM telling her to watch out for a line of t-storms heading her way. There are no windows in her classroom so when she finally left the Middle School and saw how dark the sky was she got really concerned and promptly ordered the building secretary to open the office and get a handful of students back inside.  They had just dismissed from summer-school and were waiting outside for their parents to pick them up.  Good thing she did that.</p><p>Morgan drove away from the Middle School just minutes before a wall-of-wind roared in, and she called my cell phone at 11:50 AM just as she passed our house, letting me know that she was going straight to her apartment because her landlord wasn’t home and she was worried about her cats. The 5-minute drive to her apartment took about 3 hours?  A couple of minutes later, at 11:55 AM we ran to our basement (after a 2nd mailbox went sailing past our front door) and Morgan called again at 11:58 AM. Her car had been hit by a falling tree limb, about 6' in diameter, near the crest of the hill on State Street in Tama, just south of the Tama Park. Her windshield was shattered, fortunately on the passenger’s side, and she was freaking out. I told her to stay in her car and Christine called 9-1-1 to provide her with some emergency aid.</p><p>The 9-1-1 call had to route through Benton county (30 miles east of us) as the local center was already overwhelmed, and the storm hadn’t hit there yet. A local police officer was dispatched and could get no closer than about 2.5 blocks from Morgan’s car due to downed trees, but made his way to her on-foot. He told her same as me, stay in your car to avoid downed power lines and potentially being hit by flying debris. He also told her to fasten her seatbelt in case the wind flipped the car over. Yikes!  That happened at 12:18 PM, and the wind was still fierce!</p><p>At 12:20 PM my wife realized where Morgan was and called a friend who lives at the location of Morgan’s “tree incident”, and that friend managed to summon her inside once it was safe to make a run for it.</p><h2 id='1230-pm---the-wind-finally-stopped-time-to-rescue-morgan'>12:30 PM - The Wind Finally Stopped, Time to “Rescue” Morgan</h2><p>It was about 12:30 PM when I felt like it was finally safe to go back upstairs and outside. Our mission was to try and get to Morgan as soon as possible.  The power was out so I could not easily raise our double garage door, so I peeked out the front door to see what the situation was. OMG!</p><p>Our house is about 70 years old and it is (was) surrounded by five very large, mature trees… two grand old Oaks flanking the front yard, an American Sycamore directly west of our garage and patio, and two very tall pines on the NW and NE corners of the house, plus a few smaller and younger trees and bushes. Our driveway measures about 15’ x 45’ and it was entirely covered in limbs from one of the oaks and the Sycamore. Some of the limbs down on the driveway measured more than 10' in diameter.  It ultimately took about 14 hours of back-breaking effort just to clear the driveway well enough for us to get both vehicles out of the garage.</p><p>In the immediate aftermath of the storm I had two other transportation options: the bicycle I had just purchased on Saturday, August 8; or my daughter Mackenzie’s car which was parked at the curb west of our house. I was pretty sure that car, parked partly beneath one of the oaks and the Sycamore, would be badly damaged, but it was not. There were limbs and whole trees, from our neighbor to the west, lying all around it, but the car was unscathed and operable.  It took a little serpentine driving to navigate out of it’s parking spot, but by about 12:45 PM Christine and I were able to get it out and on-the road to try and “rescue” Morgan, roughly 1/2-mile away.</p><p>That 1/2-mile trip featured five impassable streets and a mile or two of back-tracking to find a suitable (barely) route.  The four-lane US Highway 63 proved to be the best route for most of the trip only because it was wide enough that trees on the west side generally didn’t block all four lanes. We arrived in the vicinity of Morgan’s car at 1:02 PM and found that she had already pulled the largest limb off her car, what was left looked like this:</p><p><figure><img alt='Morgan&amp;rsquo;s Damaged Nissan Rogue - A Total Loss' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_2053.jpeg'/><figcaption>Morgan's Damaged Nissan Rogue - A Total Loss</figcaption></figure></p><p>Morgan’s apartment is about 1-mile from the location where we left her car, and she knew that her landlord and family were away in Cedar Rapids for the day, so we headed there to check on that property, and her cats. That trip took about 10 minutes with numerous “detours” but I was able to drive to within a half-block of the house.  Thankfully we found the house intact with no visible, major damage, and the cats were safe, but obviously frightened, still inside Morgan’s apartment. Fortunately, the large old tree outside Morgan’s apartment window was damaged earlier this year in a storm, and had to be taken down entirely just a couple of weeks ago; otherwise it would have certainly damaged the house and her apartment. We called the landlord to report the relatively good news as they tried to begin their journey back home from CR. Then it started to rain again, just a little.</p><h2 id='the-damage'>The Damage</h2><p>This part of the story is perhaps best told in pictures. I took some photos and am posting them here in chronological order, with descriptive captions.</p><h3 id='first-glimpse-out-the-window'>First Glimpse Out the Window</h3><p><figure><img alt='18 First Glimpse from Inside the House - South Facing Window Looking Out on the Driveway' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2018.png'/><figcaption>First Glimpse from Inside the House - South Facing Window Looking Out on the Driveway</figcaption></figure></p><p><figure><img alt='19 First Glimpse from Inside the House - South Facing Window Looking SE at the Mailboxes' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2019.png'/><figcaption>First Glimpse from Inside the House - South Facing Window Looking SE at the Mailboxes</figcaption></figure></p><p><figure><img alt='17 View from My Home Office Window an Hour After - Lookng NE' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2017.png'/><figcaption>View from My Home Office Window an Hour After - Lookng NE</figcaption></figure></p><h3 id='headed-outside-to-shoot-more-photos'>Headed Outside to Shoot More Photos</h3><p>The power was out everywhere for 30 to 50 miles all around us so we assumed it was safe to get outside and take some better photos.  No chance of getting cars out of the garage… our driveway was at least 80% covered by tree parts, some places it was 4 feet deep.</p><p><figure><img alt='20 Looking NW at the House from Where the Mailboxes Used to Be' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2020.png'/><figcaption>Looking NW at the House from Where the Mailboxes Used to Be</figcaption></figure></p><p><figure><img alt='21 Yes, That&amp;rsquo;s Our Mailbox' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2021.png'/><figcaption>Yup, That's Our Mailbox</figcaption></figure></p><p><figure><img alt='22 Looking NW from the Mailboxes - Our Driveway is Under All of That Forest' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2022.png'/><figcaption>Looking NW from the Mailboxes - Our Driveway is Under That Forest</figcaption></figure></p><p><figure><img alt='23 Looking North from the Bottom of Our Driveway' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2023.png'/><figcaption>Looking North from the Bottom of Our Driveway</figcaption></figure></p><p><figure><img alt='24 Looking SW from Just Outside Our Garage' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2024.png'/><figcaption>Looking SW from Just Outside Our Garage</figcaption></figure></p><p><figure><img alt='25 Looking Due South from Just Outside Our Garage' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2025.png'/><figcaption>Looking Due South from Just Outside Our Garage</figcaption></figure></p><p><figure><img alt='26 Looking East from the Top of Our Driveway' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2026.png'/><figcaption>Looking East from the Top of Our Driveway</figcaption></figure></p><h3 id='west-side-story---the-rolling-stone-hot-tub-grill-and-limbs-on-the-roof'>West Side Story - The “Rolling Stone”, Hot Tub, Grill, and Limbs on the Roof</h3><p>There were three pleasantly-amazing (lucky) things that happened, or didn’t happen as the case may be, on the west, windward, side of the house.</p><p>First up, my home-made lightweight teardrop camper, “The Rolling Stone”.  It’s the gray thing that looks like a big old boulder on wheels in the right side of the first image below.  It survived, almost unscathed! The only damage was from the door being blown open.  That door hit the west wall of the house so hard that it bent a 1/8' thick steel latch plate back at a 120° angle. Because the door was open, things just inside the door also got a little wet, but they dried out well since then.  The whole camper pitched forward about 3’ in the wind, but the on-board drop-foot was down so it didn’t fall to the ground. Had any large limbs fallen directly on it, we’d have had a total loss of structure and contents.</p><p><figure><img alt='30 Looking SE from the NW Corner of Our Property' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2030.png'/><figcaption>Looking SE from the NW Corner of Our Property</figcaption></figure></p><p>Next, the hot tub and grill. The very first thing I did when I got outdoors after the storm was to flip the hot tub cover back down.  I have yet to clean all the leaves and debris out of the water…maybe later today.</p><p>When I receive any alert of a possible storm I always move one of the concrete blocks, seen stacked on the right in the image below, over to the west edge of my hot tub cover in order to keep it from blowing open.  I made that move about 15 minutes before the storm hit, but it didn’t help. In fact, it did more damage, I think.  The cover seems to be OK, but the wind did flip it open, sending the concrete block sailing about 10’ into the side of the house and narrowly missing the bathroom window that you can see. Lucky for us!</p><p>But our gas grill was not so lucky. That concrete block smashed down upon it leaving a big dent in the top, and causing the grill to “list” about 2' to port (the left side when looking from back to front).</p><p><figure><img alt='31 Looking at the Hot Tub and Limbs on the Roof' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2031.png'/><figcaption>Looking at the Hot Tub and Limbs on the Roof</figcaption></figure></p><p><figure><img alt='45 The Grill' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_3531.png'/><figcaption>Our 1-Year-Old Gas Grill</figcaption></figure></p><p><figure><img alt='27 Looking South from NW Corner of Our Property' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2027.png'/><figcaption>Looking South from NW Corner of Our Property</figcaption></figure></p><p>Finally, the limbs on the roof; you can see them clearly in some of these images. There were actually three of them, the largest with a diameter of about 5' at its base.  All three were from the Sycamore tree, which I suppose is lucky.  Sycamore’s have ENORMOUS leaves and while I feared severe damage to the roof, it looks like all three limbs just gently “floated” down to where I found them. I got them sawed up, and down off the roof, including an informal damage inspection plus wasp nest encounter, on Tuesday, August 11.</p><p><figure><img alt='28 Looking SE from the NW Corner of Our Property' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2028.png'/><figcaption>Looking SE from the NW Corner of Our Property</figcaption></figure></p><p><figure><img alt='29 Looking East from the NW Corner of Our Property' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2029.png'/><figcaption>Looking East from the NW Corner of Our Property</figcaption></figure></p><h2 id='the-cleanup'>The Cleanup</h2><h3 id='building-the-worlds-largest--boma'>Building the World’s Largest (?) Boma</h3><p>The mayors of Tama and Toledo, along with the Tama Co. Emergency Management office, called a public meeting, conducted in the parking lot of the nearby Tama-Toledo Family Aquatic Center, for 6 PM on Wednesday, August 12. At that meeting the cities informed everyone that any debris left at the curb would eventually be picked up and disposed of by a city crew. So, we started building what I like to think of as the world’s largest <a href='https://en.wikipedia.org/wiki/Boma_(enclosure)'>boma</a>.</p><p>In the images below you can see both our west and south bomas.  We didn’t need any on the east or north since we have neighbors on those sides, but we did build a small boma (about 30’ long by 10’ wide) in the parking lot of the church that sits at the NE corner of our property, where our utilities pole is located.</p><p><figure><img alt='2 The West Boma - Panoramic' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%202.png'/><figcaption>The West Boma - Panoramic</figcaption></figure></p><p><figure><img alt='14 The South Boma - Panoramic' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2014.png'/><figcaption>The South Boma - Panoramic</figcaption></figure></p><p><figure><img alt='6 The West Boma - Close-up' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%206.png'/><figcaption>The West Boma - Close-up</figcaption></figure></p><p><figure><img alt='10 The South Boma - Close-up' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2010.png'/><figcaption>The South Boma - Close-up</figcaption></figure></p><p><figure><img alt='15 The South Boma - Close-up Looking West' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2015.png'/><figcaption>The South Boma - Close-up Looking West</figcaption></figure></p><p><figure><img alt='44 SE Corner of the Property Looking at the Start of the South Boma' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2044.png'/><figcaption>SE Corner of the Property Looking at the Start of the South Boma</figcaption></figure></p><h3 id='the-tree-wrangler'>The Tree Wrangler</h3><p>On Thursday, August 13, I started to address some of the potential widow-makers still hanging in our trees.  My first target was the one shown below. I managed to rig a short chain to the end of a nylon rope and after about 10 tries I got the chain wrapped around the most menacing widow-maker, and yanked that sucker right out of the tree. They call me the “Tree Wrangler”. I’m pleased to report that subsequent limb-roping adventures took fewer tosses!</p><p><figure><img alt='38 The Tree Wrangler Roped His First Stray' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2038.png'/><figcaption>'The Tree Wrangler' Roped His First Stray</figcaption></figure></p><p><figure><img alt='42 Roped My First Stray Tree Limb' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2042.png'/><figcaption>Roped My First Stray Tree Limb</figcaption></figure></p><p>Do you remember seeing an ominous widow-maker in the Sycamore tree in earlier images?  Well she is no more.  At about 1:30 PM on Wednesday, August 19, I roped that critter and managed, with considerable effort, to yank that bad boy down.  Proof that “The Tree Wrangler” has struck again…</p><p><figure><img alt='I Hath Slain Another Widow-Maker' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_0592.jpeg'/><figcaption>I Hath Slain Another Widow-Maker</figcaption></figure></p><h3 id='more-random-photos---post-cleanup'>More Random Photos - Post Cleanup</h3><p>Just posting more random, post-cleanup photos here.</p><p><figure><img alt='3 The Back Yard - After Cleanup' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%203.png'/><figcaption>The Back Yard - After Cleanup</figcaption></figure></p><p><figure><img alt='5 Widow-Maker in the Sycamore' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%205.png'/><figcaption>Widow-Maker in the Sycamore</figcaption></figure></p><p><figure><img alt='7 Widow-Maker in the SW Oak' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%207.png'/><figcaption>Widow-Maker in the SW Oak</figcaption></figure></p><p><figure><img alt='8 SW Corner of the House After Cleanup' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%208.png'/><figcaption>SW Corner of the House After Cleanup</figcaption></figure></p><p><figure><img alt='9 Across the Street Looking South - After Cleanup' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%209.png'/><figcaption>Across the Street Looking South - After Cleanup</figcaption></figure></p><p><figure><img alt='11 The SE Oak - After Cleanup' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2011.png'/><figcaption>The SE Oak - After Cleanup</figcaption></figure></p><p><figure><img alt='12 NE Corner of the House - After Cleanup' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2012.png'/><figcaption>NE Corner of the House - After Cleanup</figcaption></figure></p><p><figure><img alt='13 NE Corner of the House - After Cleanup with Alliant&amp;rsquo;s Line Hanging Limp' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2013.png'/><figcaption>NE Corner of the House - After Cleanup with Alliant's Line Hanging Limp</figcaption></figure></p><h3 id='the-kansas-city-chiefs---still-world-champs'>The Kansas City Chiefs - Still World Champs</h3><p>After closing the hot tub cover I made sure to get out and untangle my KC Chiefs flag!</p><p><figure><img alt='43 SE Corner of the House - After I Untangled the Chief&amp;rsquo;s Flag' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2043.png'/><figcaption>SE Corner of the House - After I Untangled the Chief's Flag</figcaption></figure></p><h3 id='our-800-savior'>Our $800 Savior</h3><p>On Wednesday morning, August 12, I got word that some of the big-box hardware stores in Cedar Rapids and Waterloo were receiving shipments of portable generators. They were being sold on a first-come basis, right off the truck, so Morgan and I got in the van and headed to Waterloo as fast as possible…we got one at Lowe’s for $800.  Had to wait in line for a couple of hours too, but managed to get home mid-afternoon with the generator, some ice and gasoline. None of those things would be available locally until Friday, August 14.</p><p><figure><img alt='16 Our Savior' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2016.png'/><figcaption>Our Savior</figcaption></figure></p><h3 id='my-biggest-remaining-concern---broken-at-the-base'>My Biggest Remaining Concern - Broken at the Base?</h3><p>My biggest remaining worry is the pine tree at the NW corner of the house.  On Thursday, August 13, during clean-up I discovered that the bark on the SE side of the tree is “crushed” as you can see in the image below, and there’s a visible “crack” on the NW side of the tree right at ground-level. Upon closer inspection it looks like the tree is leaning about 5°, naturally right toward our house. 😟</p><p><figure><img alt='1 Broken at the Base?' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%201.png'/><figcaption>Broken at the Base?</figcaption></figure></p><h3 id='houston-we-have-a-problem-or-the-eagle-has-landed'>Houston, We Have a Problem OR The Eagle Has Landed!</h3><p>One block west of our house there’s a bank, and it used to have a large golden-colored eagle atop it’s electronic sign at the intersection of Summit Street and US Highway 63.  When we told folks from out-of-town how to find us we would always use that eagle as a navigational aid, telling them to find the eagle and head one block east to our house.</p><p>Well, our navigational aid got its wings during the storm.  As you can see in the photos below, the eagle “flew” about 200 feet and landed in the bank’s lawn.</p><p><figure><img alt='33 The Eagle Has Landed!' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2033.png'/><figcaption>The Eagle Has Landed!</figcaption></figure></p><p><figure><img alt='35 The Eagle&amp;rsquo;s Flight Path - Panoramic' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2035.png'/><figcaption>The Eagle's Flight Path - Panoramic</figcaption></figure></p><h3 id='with-no-apparent-structural-damage-we-were-luckier-than-some'>With No Apparent Structural Damage, We Were Luckier Than Some</h3><p><figure><img alt='36 Formerly Thys Chevrolet - 1/2-mile from Home' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Derecho%20-%2036.png'/><figcaption>Formerly Thys Chevrolet - 1/2-mile from Home</figcaption></figure></p><p><figure><img alt='Just One of Several Collapsed Buildings on My In-Law&amp;rsquo;s Farm' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/IMG_2157.jpeg'/><figcaption>Just One of Several Collapsed Buildings on My In-Law's Farm</figcaption></figure></p><h2 id='oak-hill-cemetery---august-20-2020'>Oak Hill Cemetery - August 20, 2020</h2><p>Since all the Alliant trucks rolled past our house around 10 AM this morning, I thought it was time to visit Ian and my parents at Oak Hill Cemetery. Frustrations at home certainly weren’t getting any better so I felt like getting away to take a deep breath and realign my perspective a little.  Oak Hill usually does that for me.</p><p>Oak Hill Cemetery is well-named…it blankets the hill with Ian and my parents’ graves near the very top, and there are lots of oaks, but even more pines. Well, there used to be anyway.</p><p>This is perhaps another case where photos tell the story better than I.  However, I’m not sure the few photos I took will reflect the scale of the devastation. For starters, the main road up to the cemetery is still blocked, as are the three entrances into the original cemetery. Fortunately, the newest section where there are no mature trees, was relatively clear. So, Morgan and I were able to drive in and park about 100 yards from the hilltop.</p><p>This is a glimpse of what we found there…</p><p><figure><img alt='Oak Hill Cemetery from Near the Hilltop Looking South' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Photo-2020-08-20-19-41.jpeg'/><figcaption>Oak Hill Cemetery from Our Parked Car, Looking South</figcaption></figure></p><p><figure><img alt='180 Degree Panorama' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Photo-2020-08-20-19-43.jpeg'/><figcaption>Oak Hill Cemetery - 180 Degree Panorama</figcaption></figure></p><p>I could not bear to shoot the panorama over the opposing 180° view…it was just too sad. 😢</p><p><figure><img alt='The Big Pine Near the McFate Plots' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Photo-2020-08-20-19-49.jpeg'/><figcaption>The Big Pine Near the McFate Plots</figcaption></figure></p><p>The broken pine, shown above, is, or was, near my parents’ graves, and you can see their shared headstone just to the right in the image above.  My son, Ian, is buried a little to the left of the edge of the image, but you can’t see that grave from this angle because of all the tree debris. <a href='https://coord.info/GC4BG3B'>“Ian’s Cache”, GC4BG3B</a> is somewhere inside or under that tree. I looked for the container for about 15 minutes this morning, but came up empty-handed. 😦</p><p>Fortunately, when the ol’ tree fell it missed Ian’s grave by a few feet. We got lucky and found all four of the clear acrylic cylinders that used to adorn his grave. They are all intact, but need a little TLC before we put them all back out.</p><p>My parents’ headstone is in good shape, but another tree toppled the nearby stone marker for my aunt, Dorothy Paddleford. I’ll see to it that gets fixed soon.</p><p>A few weeks ago my brother-in-law, Dennis, set in-motion a plan to install an engraved stone bench as a memorial for my sister, Marlene McFate Burkheimer. It was to be placed not far from the cemetery road at the very top of the hill, about 50’ from the big pine.  At one time we thought about looking into wrapping a bench around that ol’ pine to provide a nice place, in the shade, to sit and relax. However, providing a concrete base for such a bench would have been very difficult. Maybe if the pine’s stump is removed we can place the bench where the tree was, and maybe one day plant another tree to provide the shady spot we hoped for?</p><p><figure><img alt='Another View to the South from Ian&amp;rsquo;s Grave - The Road is Still Impassable' src='https://images-summittdweller.nyc3.digitaloceanspaces.com/2020-Aug-10-Derecho/Photo-2020-08-20-19-51.jpeg'/><figcaption>Another View to the South from Ian's Grave - The Road is Still Impassable</figcaption></figure></p><p>Tomorrow morning I plan to contact the City of Tama and the Oak Hill Cemetery Association to see about volunteering to help with clean-up. I think they are going to want all the help they can get in the coming weeks and months.</p><h2 id='gnight'>G’night</h2><p>It’s late-evening again, but at least now I have some real lights to work by.  Tomorrow I need to start reprogramming all the devices that have been dead for 11.5 days, and begin making up for as many days of missed work. Time for bed. G’night all.</p><p>Until next time… but I hope there’s never another “next time” quite like this one!</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1597708800
      }

,
      
      {
        "id": "23",
        "title": "The Derecho: Consolidated Posts and Microposts: August 10 thru September 6, 2020",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>The following is a chronological consolidation of posts and microposts from August 10, commonly known in east and central Iowa as “The Day of the Derecho”, through September 6, 2020.</p><div class='original'><p>The derecho hit my home in Toledo, Iowa, at about 11:30 AM on Monday, August 10, 2020.  Straight-line winds were clocked at nearly 140 miles per hour, and sustained for more than 20 minutes across a path almost 40 miles wide.</p></div><article class='micropost'><p>  The power is still out here, almost 10 days after the derecho knocked it out. So many power restoration predictions have come and gone, I’ve lost count. Still I’m told that what we need is a one-man, 15-minute fix. Perhaps in the morning I’ll stretch our broken power line across the street and pitch a tent next door until an Alliant truck stops and gets this done. I know they are busy, but 15 minutes of one lineman’s time a week ago, when it was first “promised”, would have been so nice. I fixed my own Mediacom connection more than a week ago, and there’s evidence tonight that their service has been restored.  So, if I had power, I think we would also have TV and internet.  IF.  <aside class='postmeta'>→ 2020/08/19 11:45 PM          posted from Toledo, IA      </aside></p></article><article class='micropost'><p>  It’s the start of day number eleven, and still no power. Checked the forecast and it’s getting hot…so am I!  <aside class='postmeta'>→ 2020/08/20 8:21 AM          posted from Toledo, IA      </aside></p></article><article class='micropost'><p>  Eleven days and seven hours without, but the power is now back on at 104 W. Summit Street in Toledo. I’d estimate that for the duration we burned about 105 gallons of gas just to keep the fridge, my CPAP, one lamp, and two fans running.  Glad to be back in the 21st century. Now, what’s all this I hear about a deadly virus and some political scuffles?  <aside class='postmeta'>→ 2020/08/20 7:48 PM          posted from Toledo, IA      </aside></p></article><article class='post'><h2><a href='../../08/iowahurricane2020/index.html' rel='full-article'>Iowa's 2020 Hurricane</a></h2><div class='postmeta'>    Posted on 2020/08/20 10:18 PM          from Toledo, Iowa      </div></article><article class='post'><h2><a href='../../08/2020-derecho-follow-up-august-23/index.html' rel='full-article'>Derecho Follow-Up - Saturday, August 22</a></h2><div class='postmeta'>    Posted on 2020/08/22 9:45 PM          from Toledo, Iowa      </div></article><article class='micropost'><p>  And so begins day number 11 without power. I think I have watched at least a dozen Alliant energy trucks Drive by the house already this morning. I honestly don’t think they know where we are.  <aside class='postmeta'>→ 2021/08/21 9:28 AM          posted from Toledo, IA      </aside></p></article><article class='micropost'><p>  Today, Sunday, August 23, 2020, marked the start of what looks like another schorching heat-wave here. So I pitched in during the morning at the home of my “scurry” partners Jeff and Mary Fasse-Shaw, to help with cutting up some of the deadfall along the creek on the west side of their property.  We got a good start, but there’s a lot of fallen timber to be cleared there!  <aside class='postmeta'>→ 2020/08/23 5:33 PM          posted from Toledo, Iowa      </aside></p></article><article class='post'><h2><a href='../../08/tama-toledo-parks-2020-derecho-follow-up-august-24/index.html' rel='full-article'>Tama-Toledo Parks - Derecho Follow-Up for August 24</a></h2><div class='postmeta'>    Posted on 2020/08/24 11:20 AM          from Toledo, Iowa      </div></article><article class='post'><h2><a href='../last-of-the-derecho-damage-september-6/index.html' rel='full-article'>Last of the Clean-up? - Derecho Follow-Up for September 6</a></h2><div class='postmeta'>    Posted on 2020/09/06 7:52 PM          from Toledo, Iowa      </div></article></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1664064000
      }

,
      
      {
        "id": "24",
        "title": "Atom No More?",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Yesterday one of my library colleagues at Grinnell College posted an <a href='https://github.blog/2022-06-08-sunsetting-atom/'>announcement</a> that <a href='https://atom.io'>Atom</a> would be retired (sunset) in December 2022.  Ouch, I have a lot of workflows that depend on <em>Atom</em>!</p><p>So, today part of my mission is to begin the process of migrating workflows, both work-related and personal/at-home, from <em>Atom</em> to its most logical replacement, <a href='https://code.visualstudio.com/'>Visual Studio Code</a> or <em>VS Code</em> as it’s largely known in the development community.  The other part of today’s mission was to update <a href='https://blog.summittdweller.com/'>this blog</a>, something I’ve not done in far too long!</p><p>What better time to begin using <em>VS Code</em> than right now, to edit <a href='http://localhost:1313/posts/2022/06/atom-no-more/posts/2022/06/atom-no-more/'>this blog post</a>?  So, that’s what I did, er, am doing.</p><p>This could be a long story, but I’ll keep it short and just share the links, mostly.  I’ll begin on my personal Mac Mini, where I’m editing now, so I can test the entire process before repeating it on my other Mac workstations.</p><h2 id='install-using-homebrew'>Install Using Homebrew</h2><p>I like to use <code>homebrew</code> whenever possible to manage installations on my Mac. On this Mac Mini I found <a href='https://formulae.brew.sh/cask/visual-studio-code'>this Homebrew Formulae</a> and put it to use…  All done.  Nice!</p><h2 id='adding-a-command-line--terminal-shortcut'>Adding a Command Line / Terminal Shortcut</h2><p>I’ve gotten quite used to launching <em>Atom</em> in my working directory with a simple command of the form <code>atom .</code>.  Can I do the same with <em>VS Code</em>?  Sure!  I used the guidance found in <a href='https://www.freecodecamp.org/news/how-to-open-visual-studio-code-from-your-terminal/'>How to Open Visual Studio Code From Your Terminal</a> to set that up.  Piece of cake.  I love finding timely, not stale, advice that just works!</p><p>Now I can simply navigate to a project folder on my Mac and type <code>code .</code> to open it all in <em>VS Code</em>.  Sweet!</p><h2 id='replacing-my-atom-packages'>Replacing My Atom Packages</h2><p>There are quite a few, nothing that I’ve written personally, but lots of published packages/extensions borrowed from others.  That’s one of the things I love(d) about <em>Atom</em>. On my Mac Mini, and most other Macs, that list looks something like this:</p><p><figure><img alt='My Installed Atom Packages' src='http://localhost:1313/img/my-atom-packages.png'/><figcaption></figcaption></figure></p><p>I told you there were quite a few.  I’m posting this image of my list just so I have a document as I begin to build the same into <em>VS Code</em>.  Oh, when I added the above image to this post, I did so by dragging my screen-capture from my desktop directly into the <em>VS Code</em> <code>EXPLORER</code> panel (left side of my window), just like I used to do with <em>Atom</em>.  Nice!</p><p>I’ll take my time and start replacing these as-needed.  First up…</p><h3 id='replacing-iso-8601-timestamp'>Replacing <code>ISO 8601 timestamp</code></h3><p>This <em>Atom</em> package allows me to add the current date and time, in ISO 8601 format, to the frontmatter of a blog post like the one you are reading now.  I found and followed <a href='https://marketplace.visualstudio.com/items?itemName=jsynowiec.vscode-insertdatestring'>this documentation</a> to set it up in <em>VS Code</em>.  In <em>Atom</em> I put my cursor at the point where my timestamp was needed, and went to the <code>Packages</code> menu to insert it.  In <em>VS Code</em> there doesn’t appear to be such a menu, but the documentation says I can use <code>command-shift-P</code> to open the “command pallette”, where I can scroll to or search for the command I want to engage.  Another piece of cake!</p><p>The result of inserting the current timestamp should be reflected in the frontmatter of this blog post.  😀</p><h2 id='more-goodies'>More Goodies</h2><p>This morning I updated this entry after adding a <code>Duplicate file or directory</code> command using the <a href='https://marketplace.visualstudio.com/items?itemName=mrmlnc.vscode-duplicate'>Duplicate Action</a> extension from the marketplace.  It works very nicely!</p><p>What’s could be better?  Well, finding a list of <a href='https://dev.to/gsdev/10-vscode-extensions-i-can-t-live-without-1i5c'>10 “must-have” <em>VSCode</em> extensions</a> and working my way through them!</p><h2 id='luna-paint'>Luna Paint</h2><p>I just stumbled across another handy <em>VSCode</em> extension, <code>Luna Paint</code>.  I’ve installed it, took all of 2 minutes to update TWO Macs, using the guidance provided in <a href='https://www.youtube.com/watch?v=I_6bZQZheC0'>this YouTube video</a>.  It rocks!   2022-07-19T10:07:39-05:00</p><hr/><p>With any luck I’ll be able to use this post to perform much the same configuration on my other Macs, soon.  I promised I’d keep this long story short, so, until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1654732800
      }

,
      
      {
        "id": "25",
        "title": "Travel...MSP to CDG to OSL to KKN",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><figure><img src='https://images-summittdweller.nyc3.digitaloceanspaces.com/Norway-Photos-2019/Minneapolis-Saint%20Paul%20International%20Airport%20-%20Minneapolis,%20MN,%20June%2011,%202019/IMG_0352.png'/><figcaption>This was a very long day in the air, and then we discovered the 'midnight sun'!</figcaption></figure><p>This post is really part of my <a href='http://weblog-sd.docksal/photos/norway-june-2019/norway-june-2019/'>Norway photo blog</a> which you can find elsewhere on this site.  Note that the photos here are in reverse-chronological order with the exception of one “lead” post that lays out our itinerary.  So, read on…</p><p>I drove the 5 of us, plus luggage, in our mini-van to Minneapolis for our departure, and we left home early just in case there were surprises.  Good thing we did!  I drove US 20 to I35 with a stop in Storm Lake for a late lunch.  Not long after that stop we hit the first snag and found I35 closed, in both directions, just south of the Iowa-Minnesota border.  The stop and detour there set us back about a half hour or so…no problem.</p><p>We booked and found off-site parking near the airport in Minneapolis, and got dropped off at the correct terminal for <em>Iceland Air</em>, which will forever be known in this household as <code>Iceland Error</code>.  That’s when things really go interesting.  <code>Iceland Error</code> had changed our flight, and itinerary, without notice (they have no mobile app).  We would be leaving the US about an hour later, good thing, and arriving in Kirkenes about 16 hours ahead of our original schedule! We weren’t even booked on <code>Iceland Error</code> for our departure, instead we were flying <em>Air France</em> to Paris, then to Oslo, and connecting directly to Kirkenes.</p><p>The change meant we had to change terminals, back to the terminal we’d just come from with luggage in tow. Not fun.</p><p>Ok, so <em>Air France</em> was GREAT!  They fed us, we had comfortable seats, they dimmed the lights, had nice entertainment, and provided whatever we needed at no extra charge. For the record, <code>Iceland Error</code> did NONE of that on our return to the U.S.</p><p>But I digress… We got to Paris without a hitch and in good spirits, found our connecting flight to Oslo and made that leg in good shape.  Then on to Kirkenes rather than staying a night in Oslo, and that was OK, except that Kirkenes isn’t a big city, and when we arrived ahead of schedule there was no shuttle waiting for us (the one that did arrive was full), but the good folks there dispatched one especially for us.</p><p>We arrived at our hotel around 11 PM local time, I think.  Of course, it was difficult to tell the time because the sun was still up, and would remain “up” for pretty much the next 4 days!</p><p>The hotel had only one spare room for the night, so Chris and I took that one, and they arranged for Mark, Deb and Doug to taxi about 30 minutes outside of town to a “cabin” near the Russian border.  Lucky for them…they got to set foot, or at least a big toe, in Russia, at about 2 AM, I think.  Silly Americans.  😁</p><p>To be honest, I loved the “midnight sun”, it was great for geocaching, but really put a dent in my already damaged sleep schedule. 😉</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1560297600
      }

,
      
      {
        "id": "26",
        "title": "Eastbound from Seattle - Day 1",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='day-1---seattle-wa-to-lakeview-or'>Day 1 - Seattle, WA to Lakeview, OR</h1><p>This is our planned route for Day 1 (eastbound) using a <code>speed factor of 1.0</code> (traveling at the speed limit).  Fuel cost is based on <code>40 mpg</code> and <code>$4.00 per gallon</code> averages.  Fuel stops typically have a 15-minute duration and rest areas allow 5-minutes each.</p><p>A list of possible geocache targets for the entire route can be found at <a href='https://www.geocaching.com/play/map/lists/BMBBMD6'>https://www.geocaching.com/play/map/lists/BMBBMD6</a>.</p><iframe src='http://localhost:1313/html/Eastbound-Day-1.html' style='width: 100%; height: 400px; border:1;' title='Eastbound Day 1'></iframe></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1659830400
      }

,
      
      {
        "id": "27",
        "title": "Westbound to Seattle - Day 1",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='day-1---toledo-ia-to-glendive-mt'>Day 1 - Toledo, IA to Glendive, MT</h1><p>This is our planned route for Day 1 using a <code>speed factor of 1.0</code> (traveling at the speed limit).  Fuel cost is based on <code>40 mpg</code> and <code>$4.00 per gallon</code> averages.  Fuel stops typically have a 15-minute duration and rest areas allow 5-minutes each.</p><p>A list of possible geocache targets for the entire route can be found at <a href='https://www.geocaching.com/play/map/lists/BMBBMD6'>https://www.geocaching.com/play/map/lists/BMBBMD6</a>.</p><iframe src='http://localhost:1313/html/Westbound-Day-1.html' style='width: 100%; height: 400px; border:1;' title='Westbound Day 1'></iframe></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1659830400
      }

,
      
      {
        "id": "28",
        "title": "My MQTT Weekend",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Now that I’ve cleared the driveway of the latest snowfall, I am officially declaring this to be “<strong>My MQTT Weekend</strong>”.  It actually started on Friday night, the weekend, not the snow.  Rather than posting a lot of gibberish here, I’ll just point you to my project repo at <a href='https://github.com/SummittDweller/Motorized_MQTT_Blinds'>https://github.com/SummittDweller/Motorized_MQTT_Blinds</a> and especially the <a href='https://github.com/SummittDweller/Motorized_MQTT_Blinds#additional-resources'>Additional Resources</a> portion of the <em>README.md</em> file there.  If/when I get this all working maybe I will post some photos, maybe.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1612051200
      }

,
      
      {
        "id": "29",
        "title": "5-Inch HDMI Raspberry Pi Touch Screen",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>A couple of years have now passed since I purchased an <a href='https://www.amazon.com/Elecrow-Display-Monitor-800x480-Raspberry/dp/B013JECYF2/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=mmjjg-20&amp;linkId=df2d8e154ca1d5ca9fb992d34677ebd3'>Elecrow 5' HDMI Touchscreen display for the Raspberry Pi</a> and put it to use.  I even 3D printed a very nice case for it.  So, there’s a bit of configuration code on the SD card that can be edited to determine if the 5' screen is active, or if the RPI’s output is directed to its HDMI output port.  Well, in the last 2 years I forgot what to edit and what changes to make.</p><p>Fortunately, when I went looking for some info to refresh my memory, I found a great resource… a review posted in 2016 from none other than <a href='https://www.jeffgeerling.com/'>Jeff Geerling</a>, aka <a href='https://github.com/geerlingguy'>geerlingguy</a>.  His review/blog post is <a href='https://www.jeffgeerling.com/blog/2016/review-elecrow-hdmi-5-800x480-tft-display-xpt2046-touch-controller'>Review: Elecrow HDMI 5' 800x480 TFT Display with XPT2046 Touch Controller</a>.  In case Jeff’s post should ever disappear, here’s the a key piece of info that I needed to jog my memory:</p><div class='original'><h2 id='getting-full-resolution-over-hdmi'>Getting full resolution over HDMI</h2><p>When I first booted the Pi attached to the display, there was a large white area on the right, and only the left portion of the screen was being used by the Pi (it was only using 640x480 of the 800x480 display). To fix this, you have to set a few display options in the configuration file the Raspberry Pi reads during startup to switch certain hardware settings.</p><p>Edit /boot/config.txt (either while booted into Raspbian, or on another computer directly on the microSD card), making sure the following values are set:</p><pre tabindex='0'><code># uncomment if you get no picture on HDMI for a # default 'safe' mode#hdmi_safe=1# uncomment this if your display has a black border of unused # pixels visible and your display can output without overscandisable_overscan=0# uncomment if hdmi display is not detected and composite # is being output#hdmi_force_hotplug=1# uncomment to force a specific HDMI mode (this will force VGA)hdmi_group=2hdmi_mode=1hdmi_mode=87hdmi_cvt=800 480 60 6 0 0 0</code></pre><p>Reboot the Pi either via the UI or by entering sudo reboot in the Terminal. Once rebooted, the Pi should fill up the full 800x480 display.</p><blockquote><p>Note: If the Pi boots up to a funny-looking screen and you can’t see anything, you can either reformat the microSD card, or pull it, edit the /boot/config.txt file from another computer to fix it, and put it back in the Pi.</p></blockquote></div></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1612483200
      }

,
      
      {
        "id": "30",
        "title": "My Photos Workflow",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>I recently returned from vacation in Norway with a few hundred photos and a handful of videos, taken mostly using my iPhone 8.  I find that the Apple Photos app does a pretty nice job of cataloging photos and videos into <code>Moments</code>.  Each <code>Moment</code> includes all the images taken in a single day, and sometimes in a particular location, if photos are taken on the same day, but a great distance apart.</p><p>Moment names from my Norway vacation were nicely descriptive, like:</p><ul><li>Minneapolis-Saint Paul International Airport - Minneapolis, MN, June 11, 2019</li><li>Paris Charles de Gaulle Airport - Mauregard, Île-de-France, June 12, 2019</li><li>Jessheim - Akershus, June 12, 2019</li><li>Kirkenes, Finnmark - Johan Knudtzens gate, June 12, 2019</li><li>Kirkenes, Finnmark - Dr. Wessels gate, June 13, 2019</li><li>Kirkenes, Finnmark - Johan Knudtzens gate, June 14, 2019</li><li>Skarsvåg - Finnmark, June 14, 2019</li><li>Arnøyhamn - Norway, June 15, 2019</li></ul><h2 id='exporting-the-photos'>Exporting the Photos</h2><p>I found <a href='https://support.apple.com/guide/photos/export-photos-videos-and-slideshows-pht6e157c5f/mac'>this resource</a> on the web and followed it for the export portion of my process.</p><p>So, I opened <code>Photos</code> on my Mac Mini, selected the <code>Moments</code> view/tab, culled some of the duplicates out, then selected all 359 remaining images using my mouse.  With the images highlighted I selected menu options: <code>File</code>, <code>Export</code>, and <code>Export 359 Photos...</code>. I subsequently filled in the following dialog like so:</p><p><figure><img alt='Photos Export Dialog' src='https://images.summittdweller.com/Norway-Photos-2019/PhotosExportDialog.png'/><figcaption></figcaption></figure></p><p>I choose a ‘Photo Kind’, or format, equal to <code>PNG</code> and a ‘Size’ equal to <code>Medium</code>, since most of the images are huge and would load very slowly in my blog if left at their original size.  I elected to save the exported PNG images into a new folder on my <code>~/Desktop</code> named <code>Norway-Medium-PNG-Export</code>.</p><h2 id='upload-to-digital-ocean-spaces'>Upload to Digital Ocean “Spaces”</h2><p>A few days ago I registered with <em>Digital Ocean</em> <a href='https://cloud.digitalocean.com/spaces?i=d7d6c7'>“Spaces”</a>, and created my first “bucket” named <code>images-summittdweller</code>. <em>Spaces</em> provides me with up to 280 GB of REST-accessible object storage for a small monthly fee.  To host my photos there I simply created a “folder” named <a href='https://cloud.digitalocean.com/spaces/images-summittdweller?i=d7d6c7&amp;path=Norway-Photos-2019%2F'>Norway-Photos-2019</a> and did a drag-n-drop of each <code>~/Desktop/Norway-Medium-PNG-Export/</code> individual* folder directly into my browser window.  *Note that the drag-n-drop interface was unable to swallow the entire <code>Norway-Medium-PNG-Export</code> folder all at once. 😞</p><p>All of my uploads to the <code>images-summittdweller</code> bucket were declared as <code>Public</code> rather than <code>Private</code>, that way they can be accessed using simple URLs without authentication.</p><h2 id='additional-images'>Additional Images</h2><p>In addition to the aforementioned photos, I also parked a copy of the <code>PhotosExportDialog.png</code> screen capture there in the root folder.  It’s accessible as <a href='https://images.summittdweller.com/Norway-Photos-2019/PhotosExportDialog.png'>https://images.summittdweller.com/Norway-Photos-2019/PhotosExportDialog.png</a> and that’s what I used above to embed the image you see in this document.</p><p>In the future, more images, perhaps some taken by Deb, Doug, or Mark McCune, can be added to this photo blog in a similar manner.</p><h2 id='object-structure-and-urls'>Object Structure and URLs</h2><p>A sampling of the bucket/object/filenames and URLs from <code>images-summittdweller</code> are tabulated below.  From this small sample the URL structure is easy to infer.</p><table><thead><tr><th>images-summittdweller Bucket Path</th><th>URL</th></tr></thead><tbody><tr><td>./Norway-Photos-2019/PhotosExportDialog.png</td><td><a href='https://images.summittdweller.com/Norway-Photos-2019/PhotosExportDialog.png'>https://images.summittdweller.com/Norway-Photos-2019/PhotosExportDialog.png</a></td></tr><tr><td>./Norway-Photos-2019/Minneapolis-Saint Paul International Airport - Minneapolis, MN, June 11, 2019/IMG_0352.png</td><td><a href='https://images.summittdweller.com/Norway-Photos-2019/Minneapolis-Saint%20Paul%20International%20Airport%20-%20Minneapolis,%20MN,%20June%2011,%202019/IMG_0352.png'>https://images.summittdweller.com/Norway-Photos-2019/Minneapolis-Saint%20Paul%20International%20Airport%20-%20Minneapolis,%20MN,%20June%2011,%202019/IMG_0352.png</a></td></tr><tr><td>./Norway-Photos-2019/Tromsø - Troms, June 15, 2019/IMG_0527.png</td><td><a href='https://images.summittdweller.com/Norway-Photos-2019/Troms%C3%B8%20-%20Troms,%20June%2015,%202019/IMG_0527.png'>https://images.summittdweller.com/Norway-Photos-2019/Troms%C3%B8%20-%20Troms,%20June%2015,%202019/IMG_0527.png</a></td></tr></tbody></table><h2 id='generating-markdown-for-blog-photos'>Generating Markdown for Blog Photos</h2><p>So the intent of all this is to populate the photo blogs that you see <a href='http://localhost:1313/posts/2019/07/my-photo-workflow/content/photos'>here</a>. To that end I’ve created a simple <a href='https://www.digitalocean.com/docs/api/'>API</a> Python3 script based on guidance provided in <a href='https://www.digitalocean.com/community/questions/how-to-access-all-the-files-stored-in-a-spaces-folder'>this article</a>.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1562198400
      }

,
      
      {
        "id": "31",
        "title": "Adding 'Remote Atom' to My DigitalOcean Server",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Last evening and early this morning I completed the addition of a new (to me) package to <em>Atom</em> on my Mac Mini.  The package is <a href='https://atom.io/packages/remote-atom'>Remote Atom</a> and I found the configuration to be a little confusing, but in the end it was worth the work.</p><h2 id='use'>Use</h2><p>The addition and configuration of this package allows me to open an <em>SSH</em> terminal/session from my Mac Mini to my <em>summitt-dweller-DO-docker</em> droplet and, with <em>Atom</em> open locally on my Mac I can issue a command like</p><pre tabindex='0'><code>ratom /opt/README.md</code></pre><p>in the terminal connected to <em>summitt-dweller-DO-docker</em>, and the specified “remote” file will open in my local <em>Atom</em>.  Better still, if I make changes to the file and save them, the remote copy is automatically updated as saved.</p><h2 id='configuration'>Configuration</h2><p>As I said, configuration was a little dicey.  Mine followed exactly what’s documented in <a href='https://atom.io/packages/remote-atom'>the project site</a>, complete with renaming <code>rmate</code> to <code>ratom</code> as suggested.  The real key to configuration has two parts:</p><ul><li><p>First, <em>Atom</em> has to be open locally. This is necessary to get the package running so that it can accept connections from the remote, and that also requires that the package is auto-started along with <em>Atom</em>.</p></li><li><p>Next, I added the following specs to <code>~/.ssh/config</code> on my Mac Mini:</p><pre tabindex='0'><code>Host 104.248.237.235  RemoteForward 52698 localhost:52698</code></pre></li></ul><p>That addition to <code>~/.ssh/config</code> allows me to run my usual <em>ssh</em> connection commands without having to specify any remote/reverse tunneling…the config does it for me automatically when the “Host” or target is <em>summitt-dweller-DO-docker</em>.  Without that spec I’d have to configure each <em>ssh</em> connection I open, like so:</p><pre tabindex='0'><code>ssh -R 52698:localhost:52698 administrator@104.248.237.235</code></pre><p>That’s a wrap. Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1584230400
      }

,
      
      {
        "id": "32",
        "title": "Launching MacDown from a Terminal",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Lately I find that I like to open <em>Markdown</em> documents in <em>MacDown</em> rather than <em>Atom</em>.  This is espeically true of things like “README.md” documents that I intend to read, but not edit. This can be done without any special configuration, assuming <em>MacDown</em> is installed and working.  To do that use a syntax like this:</p><pre tabindex='0'><code>open -b com.uranusjr.macdown path/to/document.md</code></pre><p>A command I’ve been using quite often today is: <code>open -b com.uranusjr.macdown ~/GitHub/dg-isle/docs/install/install-local-migrate.md</code>.</p><p>That’s a wrap. Until next time…</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1584230400
      }

,
      
      {
        "id": "33",
        "title": "→ Testing My ExternalURL Feature",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Really just testing out this blog’s <code>externalurl</code> feature here.  Click on the <a href='https://static.grinnell.edu/blogs/McFateM/posts/036-building-grocy-in-docksal/'><code>--&gt;</code></a> at the head of this post to see my “professional” post about building <a href='https://grocy.info/'>Grocy</a> in Docker and <a href='https://docksal.io'>Docksal</a>.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1565481600
      }
    ]
  }
}

